[Killed] BlockStatement
src/DP/LongestPalindromicSubsequence.js:2:26
 class LongestPalindromicSubsequence {
-    static LPS(original) {
-        if (!original) {
-            throw new Error("Input string cannot be null or undefined");
-        }
-
-        let reverse = original.split("").reverse().join("");
-        return this.recursiveLPS(original, reverse);
-    }
+    static LPS(original) {}
 
     static recursiveLPS(original, reverse) {
killedBy: LPS for single character string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: undefined

[Killed] BooleanLiteral
src/DP/LongestPalindromicSubsequence.js:3:13
 class LongestPalindromicSubsequence {
     static LPS(original) {
-        if (!original) {
+        if (original) {
             throw new Error("Input string cannot be null or undefined");
         }
killedBy: LPS for single character string
statusReason: Error: Input string cannot be null or undefined

[Killed] ConditionalExpression
src/DP/LongestPalindromicSubsequence.js:3:13
 class LongestPalindromicSubsequence {
     static LPS(original) {
-        if (!original) {
+        if (true) {
             throw new Error("Input string cannot be null or undefined");
         }
killedBy: LPS for single character string
statusReason: Error: Input string cannot be null or undefined

[Killed] MethodExpression
src/DP/LongestPalindromicSubsequence.js:7:23
             throw new Error("Input string cannot be null or undefined");
         }
 
-        let reverse = original.split("").reverse().join("");
+        let reverse = original.split("").join("");
         return this.recursiveLPS(original, reverse);
     }
killedBy: LPS for non-palindromic string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: "fedcba"

[Killed] StringLiteral
src/DP/LongestPalindromicSubsequence.js:7:38
             throw new Error("Input string cannot be null or undefined");
         }
 
-        let reverse = original.split("").reverse().join("");
+        let reverse = original.split("Stryker was here!").reverse().join("");
         return this.recursiveLPS(original, reverse);
     }
killedBy: LPS for non-palindromic string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: "fedcba"

[Killed] ConditionalExpression
src/DP/LongestPalindromicSubsequence.js:12:13
     }
 
     static recursiveLPS(original, reverse) {
-        if (original.length === 0 || reverse.length === 0) {
+        if (false) {
             return "";
         }
killedBy: LPS for single character string
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ConditionalExpression
src/DP/LongestPalindromicSubsequence.js:12:13
     }
 
     static recursiveLPS(original, reverse) {
-        if (original.length === 0 || reverse.length === 0) {
+        if (false || reverse.length === 0) {
             return "";
         }
killedBy: LPS for non-palindromic string
statusReason: RangeError: Maximum call stack size exceeded

[Killed] BlockStatement
src/DP/LongestPalindromicSubsequence.js:16:76
             return "";
         }
 
-        if (original[original.length - 1] === reverse[reverse.length - 1]) {
-            const bestSubResult = this.recursiveLPS(
-                original.slice(0, -1),
-                reverse.slice(0, -1)
-            );
-            return reverse[reverse.length - 1] + bestSubResult;
-        } else {
+        if (original[original.length - 1] === reverse[reverse.length - 1]) {} else {
             const bestSubResult1 = this.recursiveLPS(
                 original,
killedBy: LPS for single character string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: undefined

[Killed] EqualityOperator
src/DP/LongestPalindromicSubsequence.js:16:13
             return "";
         }
 
-        if (original[original.length - 1] === reverse[reverse.length - 1]) {
+        if (original[original.length - 1] !== reverse[reverse.length - 1]) {
             const bestSubResult = this.recursiveLPS(
                 original.slice(0, -1),
killedBy: LPS for single character string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: ""

[Killed] UnaryOperator
src/DP/LongestPalindromicSubsequence.js:18:35
 
         if (original[original.length - 1] === reverse[reverse.length - 1]) {
             const bestSubResult = this.recursiveLPS(
-                original.slice(0, -1),
+                original.slice(0, +1),
                 reverse.slice(0, -1)
             );
killedBy: LPS for a full palindromic string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdcba"
Received: "aa"

[Survived] MethodExpression
src/DP/LongestPalindromicSubsequence.js:18:17
 
         if (original[original.length - 1] === reverse[reverse.length - 1]) {
             const bestSubResult = this.recursiveLPS(
-                original.slice(0, -1),
+                original,
                 reverse.slice(0, -1)
             );

[Killed] UnaryOperator
src/DP/LongestPalindromicSubsequence.js:19:34
         if (original[original.length - 1] === reverse[reverse.length - 1]) {
             const bestSubResult = this.recursiveLPS(
                 original.slice(0, -1),
-                reverse.slice(0, -1)
+                reverse.slice(0, +1)
             );
             return reverse[reverse.length - 1] + bestSubResult;
killedBy: LPS for a full palindromic string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdcba"
Received: "aa"

[Survived] MethodExpression
src/DP/LongestPalindromicSubsequence.js:19:17
         if (original[original.length - 1] === reverse[reverse.length - 1]) {
             const bestSubResult = this.recursiveLPS(
                 original.slice(0, -1),
-                reverse.slice(0, -1)
+                reverse
             );
             return reverse[reverse.length - 1] + bestSubResult;

[Killed] ArithmeticOperator
src/DP/LongestPalindromicSubsequence.js:21:28
                 original.slice(0, -1),
                 reverse.slice(0, -1)
             );
-            return reverse[reverse.length - 1] + bestSubResult;
+            return reverse[reverse.length + 1] + bestSubResult;
         } else {
             const bestSubResult1 = this.recursiveLPS(
killedBy: LPS for single character string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: "undefined"

[Killed] ArithmeticOperator
src/DP/LongestPalindromicSubsequence.js:21:20
                 original.slice(0, -1),
                 reverse.slice(0, -1)
             );
-            return reverse[reverse.length - 1] + bestSubResult;
+            return reverse[reverse.length - 1] - bestSubResult;
         } else {
             const bestSubResult1 = this.recursiveLPS(
killedBy: LPS for single character string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: NaN

[Killed] BlockStatement
src/DP/LongestPalindromicSubsequence.js:22:16
                 reverse.slice(0, -1)
             );
             return reverse[reverse.length - 1] + bestSubResult;
-        } else {
-            const bestSubResult1 = this.recursiveLPS(
-                original,
-                reverse.slice(0, -1)
-            );
-            const bestSubResult2 = this.recursiveLPS(
-                original.slice(0, -1),
-                reverse
-            );
-
-            return bestSubResult1.length > bestSubResult2.length
-                ? bestSubResult1
-                : bestSubResult2;
-        }
+        } else {}
     }
 }
killedBy: LPS for non-palindromic string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: undefined

[Killed] UnaryOperator
src/DP/LongestPalindromicSubsequence.js:25:34
         } else {
             const bestSubResult1 = this.recursiveLPS(
                 original,
-                reverse.slice(0, -1)
+                reverse.slice(0, +1)
             );
             const bestSubResult2 = this.recursiveLPS(
killedBy: LPS for non-palindromic string
statusReason: RangeError: Maximum call stack size exceeded

[Killed] MethodExpression
src/DP/LongestPalindromicSubsequence.js:25:17
         } else {
             const bestSubResult1 = this.recursiveLPS(
                 original,
-                reverse.slice(0, -1)
+                reverse
             );
             const bestSubResult2 = this.recursiveLPS(
killedBy: LPS for non-palindromic string
statusReason: RangeError: Maximum call stack size exceeded

[Killed] UnaryOperator
src/DP/LongestPalindromicSubsequence.js:28:35
                 reverse.slice(0, -1)
             );
             const bestSubResult2 = this.recursiveLPS(
-                original.slice(0, -1),
+                original.slice(0, +1),
                 reverse
             );
killedBy: LPS for non-palindromic string
statusReason: RangeError: Maximum call stack size exceeded

[Killed] MethodExpression
src/DP/LongestPalindromicSubsequence.js:28:17
                 reverse.slice(0, -1)
             );
             const bestSubResult2 = this.recursiveLPS(
-                original.slice(0, -1),
+                original,
                 reverse
             );
killedBy: LPS for non-palindromic string
statusReason: RangeError: Maximum call stack size exceeded

[Killed] EqualityOperator
src/DP/LongestPalindromicSubsequence.js:32:20
                 reverse
             );
 
-            return bestSubResult1.length > bestSubResult2.length
+            return bestSubResult1.length >= bestSubResult2.length
                 ? bestSubResult1
                 : bestSubResult2;
killedBy: LPS for non-palindromic string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: "f"

[Killed] ConditionalExpression
src/DP/LongestPalindromicSubsequence.js:32:20
                 reverse
             );
 
-            return bestSubResult1.length > bestSubResult2.length
+            return true
                 ? bestSubResult1
                 : bestSubResult2;
killedBy: LPS for non-palindromic string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a"
Received: "f"
