[NoCoverage] ConditionalExpression
src/string/kmp.js:15:16
         this.computeLPSArray(pat, M, lps);
 
         let i = 0; // Index for text
-        while (i < N) {
+        while (false) {
             if (pat[j] === txt[i]) {
                 j++;

[NoCoverage] BlockStatement
src/string/kmp.js:15:23
         this.computeLPSArray(pat, M, lps);
 
         let i = 0; // Index for text
-        while (i < N) {
-            if (pat[j] === txt[i]) {
-                j++;
-                i++;
-            }
-            if (j === M) {
-                console.log(`Found pattern at index ${i - j}`);
-                j = lps[j - 1];
-            } else if (i < N && pat[j] !== txt[i]) {
-                // Mismatch after j matches
-                if (j !== 0) {
-                    j = lps[j - 1];
-                } else {
-                    i++;
-                }
-            }
-        }
+        while (i < N) {}
     }
 

[NoCoverage] EqualityOperator
src/string/kmp.js:16:17
 
         let i = 0; // Index for text
         while (i < N) {
-            if (pat[j] === txt[i]) {
+            if (pat[j] !== txt[i]) {
                 j++;
                 i++;

[NoCoverage] BlockStatement
src/string/kmp.js:16:36
 
         let i = 0; // Index for text
         while (i < N) {
-            if (pat[j] === txt[i]) {
-                j++;
-                i++;
-            }
+            if (pat[j] === txt[i]) {}
             if (j === M) {
                 console.log(`Found pattern at index ${i - j}`);

[NoCoverage] UpdateOperator
src/string/kmp.js:17:17
         let i = 0; // Index for text
         while (i < N) {
             if (pat[j] === txt[i]) {
-                j++;
+                j--;
                 i++;
             }

[NoCoverage] UpdateOperator
src/string/kmp.js:18:17
         while (i < N) {
             if (pat[j] === txt[i]) {
                 j++;
-                i++;
+                i--;
             }
             if (j === M) {

[NoCoverage] ConditionalExpression
src/string/kmp.js:20:17
                 j++;
                 i++;
             }
-            if (j === M) {
+            if (true) {
                 console.log(`Found pattern at index ${i - j}`);
                 j = lps[j - 1];

[NoCoverage] ConditionalExpression
src/string/kmp.js:20:17
                 j++;
                 i++;
             }
-            if (j === M) {
+            if (false) {
                 console.log(`Found pattern at index ${i - j}`);
                 j = lps[j - 1];

[NoCoverage] ArithmeticOperator
src/string/kmp.js:21:55
                 i++;
             }
             if (j === M) {
-                console.log(`Found pattern at index ${i - j}`);
+                console.log(`Found pattern at index ${i + j}`);
                 j = lps[j - 1];
             } else if (i < N && pat[j] !== txt[i]) {

[NoCoverage] ArithmeticOperator
src/string/kmp.js:22:25
             }
             if (j === M) {
                 console.log(`Found pattern at index ${i - j}`);
-                j = lps[j - 1];
+                j = lps[j + 1];
             } else if (i < N && pat[j] !== txt[i]) {
                 // Mismatch after j matches

[NoCoverage] EqualityOperator
src/string/kmp.js:23:24
             if (j === M) {
                 console.log(`Found pattern at index ${i - j}`);
                 j = lps[j - 1];
-            } else if (i < N && pat[j] !== txt[i]) {
+            } else if (i <= N && pat[j] !== txt[i]) {
                 // Mismatch after j matches
                 if (j !== 0) {

[NoCoverage] ConditionalExpression
src/string/kmp.js:23:24
             if (j === M) {
                 console.log(`Found pattern at index ${i - j}`);
                 j = lps[j - 1];
-            } else if (i < N && pat[j] !== txt[i]) {
+            } else if (false) {
                 // Mismatch after j matches
                 if (j !== 0) {

[NoCoverage] BlockStatement
src/string/kmp.js:25:30
                 j = lps[j - 1];
             } else if (i < N && pat[j] !== txt[i]) {
                 // Mismatch after j matches
-                if (j !== 0) {
-                    j = lps[j - 1];
-                } else {
+                if (j !== 0) {} else {
                     i++;
                 }

[NoCoverage] ConditionalExpression
src/string/kmp.js:25:21
                 j = lps[j - 1];
             } else if (i < N && pat[j] !== txt[i]) {
                 // Mismatch after j matches
-                if (j !== 0) {
+                if (false) {
                     j = lps[j - 1];
                 } else {

[NoCoverage] ArithmeticOperator
src/string/kmp.js:26:29
             } else if (i < N && pat[j] !== txt[i]) {
                 // Mismatch after j matches
                 if (j !== 0) {
-                    j = lps[j - 1];
+                    j = lps[j + 1];
                 } else {
                     i++;

[NoCoverage] BlockStatement
src/string/kmp.js:27:24
                 // Mismatch after j matches
                 if (j !== 0) {
                     j = lps[j - 1];
-                } else {
-                    i++;
-                }
+                } else {}
             }
         }

[NoCoverage] UpdateOperator
src/string/kmp.js:28:21
                 if (j !== 0) {
                     j = lps[j - 1];
                 } else {
-                    i++;
+                    i--;
                 }
             }

[NoCoverage] BlockStatement
src/string/kmp.js:35:41
     }
 
     // Method to compute the LPS array
-    static computeLPSArray(pat, M, lps) {
-        let len = 0; // Length of the previous longest prefix suffix
-        let i = 1;
-
-        lps[0] = 0; // lps[0] is always 0
-
-        // Loop calculates lps[i] for i = 1 to M-1
-        while (i < M) {
-            if (pat[i] === pat[len]) {
-                len++;
-                lps[i] = len;
-                i++;
-            } else {
-                if (len !== 0) {
-                    len = lps[len - 1];
-                } else {
-                    lps[i] = len;
-                    i++;
-                }
-            }
-        }
-    }
+    static computeLPSArray(pat, M, lps) {}
 }
 

[NoCoverage] ConditionalExpression
src/string/kmp.js:42:16
         lps[0] = 0; // lps[0] is always 0
 
         // Loop calculates lps[i] for i = 1 to M-1
-        while (i < M) {
+        while (false) {
             if (pat[i] === pat[len]) {
                 len++;

[NoCoverage] EqualityOperator
src/string/kmp.js:42:16
         lps[0] = 0; // lps[0] is always 0
 
         // Loop calculates lps[i] for i = 1 to M-1
-        while (i < M) {
+        while (i >= M) {
             if (pat[i] === pat[len]) {
                 len++;

[NoCoverage] ConditionalExpression
src/string/kmp.js:43:17
 
         // Loop calculates lps[i] for i = 1 to M-1
         while (i < M) {
-            if (pat[i] === pat[len]) {
+            if (false) {
                 len++;
                 lps[i] = len;

[NoCoverage] BlockStatement
src/string/kmp.js:43:38
 
         // Loop calculates lps[i] for i = 1 to M-1
         while (i < M) {
-            if (pat[i] === pat[len]) {
-                len++;
-                lps[i] = len;
-                i++;
-            } else {
+            if (pat[i] === pat[len]) {} else {
                 if (len !== 0) {
                     len = lps[len - 1];

[NoCoverage] UpdateOperator
src/string/kmp.js:44:17
         // Loop calculates lps[i] for i = 1 to M-1
         while (i < M) {
             if (pat[i] === pat[len]) {
-                len++;
+                len--;
                 lps[i] = len;
                 i++;

[NoCoverage] UpdateOperator
src/string/kmp.js:46:17
             if (pat[i] === pat[len]) {
                 len++;
                 lps[i] = len;
-                i++;
+                i--;
             } else {
                 if (len !== 0) {

[NoCoverage] BlockStatement
src/string/kmp.js:47:20
                 len++;
                 lps[i] = len;
                 i++;
-            } else {
-                if (len !== 0) {
-                    len = lps[len - 1];
-                } else {
-                    lps[i] = len;
-                    i++;
-                }
-            }
+            } else {}
         }
     }

[NoCoverage] ConditionalExpression
src/string/kmp.js:48:21
                 lps[i] = len;
                 i++;
             } else {
-                if (len !== 0) {
+                if (false) {
                     len = lps[len - 1];
                 } else {

[NoCoverage] ConditionalExpression
src/string/kmp.js:48:21
                 lps[i] = len;
                 i++;
             } else {
-                if (len !== 0) {
+                if (true) {
                     len = lps[len - 1];
                 } else {

[NoCoverage] ArithmeticOperator
src/string/kmp.js:49:31
                 i++;
             } else {
                 if (len !== 0) {
-                    len = lps[len - 1];
+                    len = lps[len + 1];
                 } else {
                     lps[i] = len;

[NoCoverage] BlockStatement
src/string/kmp.js:50:24
             } else {
                 if (len !== 0) {
                     len = lps[len - 1];
-                } else {
-                    lps[i] = len;
-                    i++;
-                }
+                } else {}
             }
         }
