[Killed] ArrowFunction
src/DP/EditDistance.js:6:53
         const len1 = word1.length;
         const len2 = word2.length;
 
-        const dp = Array.from({ length: len1 + 1 }, () => Array(len2 + 1).fill(0));
+        const dp = Array.from({ length: len1 + 1 }, () => undefined);
 
         // Initialize base cases
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Killed] ArithmeticOperator
src/DP/EditDistance.js:6:41
         const len1 = word1.length;
         const len2 = word2.length;
 
-        const dp = Array.from({ length: len1 + 1 }, () => Array(len2 + 1).fill(0));
+        const dp = Array.from({ length: len1 - 1 }, () => Array(len2 + 1).fill(0));
 
         // Initialize base cases
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Killed] UpdateOperator
src/DP/EditDistance.js:9:36
         const dp = Array.from({ length: len1 + 1 }, () => Array(len2 + 1).fill(0));
 
         // Initialize base cases
-        for (let i = 0; i <= len1; i++) {
+        for (let i = 0; i <= len1; i--) {
             dp[i][0] = i; // Deleting all characters of word1
         }
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Killed] ConditionalExpression
src/DP/EditDistance.js:9:25
         const dp = Array.from({ length: len1 + 1 }, () => Array(len2 + 1).fill(0));
 
         // Initialize base cases
-        for (let i = 0; i <= len1; i++) {
+        for (let i = 0; false; i++) {
             dp[i][0] = i; // Deleting all characters of word1
         }
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] EqualityOperator
src/DP/EditDistance.js:13:25
             dp[i][0] = i; // Deleting all characters of word1
         }
 
-        for (let j = 0; j <= len2; j++) {
+        for (let j = 0; j > len2; j++) {
             dp[0][j] = j; // Inserting all characters of word2
         }
killedBy: Edit Distance Tests Edit Distance Test 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/DP/EditDistance.js:13:25
             dp[i][0] = i; // Deleting all characters of word1
         }
 
-        for (let j = 0; j <= len2; j++) {
+        for (let j = 0; j < len2; j++) {
             dp[0][j] = j; // Inserting all characters of word2
         }
killedBy: Edit Distance Tests Edit Distance Test 5 (empty strings)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] EqualityOperator
src/DP/EditDistance.js:18:25
         }
 
         // Fill the dp table
-        for (let i = 0; i < len1; i++) {
+        for (let i = 0; i <= len1; i++) {
             const c1 = word1.charAt(i);
             for (let j = 0; j < len2; j++) {
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/DP/EditDistance.js:18:25
         }
 
         // Fill the dp table
-        for (let i = 0; i < len1; i++) {
+        for (let i = 0; i >= len1; i++) {
             const c1 = word1.charAt(i);
             for (let j = 0; j < len2; j++) {
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] MethodExpression
src/DP/EditDistance.js:19:24
 
         // Fill the dp table
         for (let i = 0; i < len1; i++) {
-            const c1 = word1.charAt(i);
+            const c1 = word1;
             for (let j = 0; j < len2; j++) {
                 const c2 = word2.charAt(j);
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5

[Killed] BlockStatement
src/DP/EditDistance.js:20:44
         // Fill the dp table
         for (let i = 0; i < len1; i++) {
             const c1 = word1.charAt(i);
-            for (let j = 0; j < len2; j++) {
-                const c2 = word2.charAt(j);
-                if (c1 === c2) {
-                    dp[i + 1][j + 1] = dp[i][j]; // Characters match
-                } else {
-                    // Calculate the minimum of insert, delete, and replace
-                    const replace = dp[i][j] + 1;
-                    const insert = dp[i][j + 1] + 1;
-                    const deletescript = dp[i + 1][j] + 1;
-
-                    dp[i + 1][j + 1] = Math.min(replace, Math.min(insert, deletescript));
-                }
-            }
+            for (let j = 0; j < len2; j++) {}
         }
 
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] ConditionalExpression
src/DP/EditDistance.js:20:29
         // Fill the dp table
         for (let i = 0; i < len1; i++) {
             const c1 = word1.charAt(i);
-            for (let j = 0; j < len2; j++) {
+            for (let j = 0; false; j++) {
                 const c2 = word2.charAt(j);
                 if (c1 === c2) {
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] MethodExpression
src/DP/EditDistance.js:21:28
         for (let i = 0; i < len1; i++) {
             const c1 = word1.charAt(i);
             for (let j = 0; j < len2; j++) {
-                const c2 = word2.charAt(j);
+                const c2 = word2;
                 if (c1 === c2) {
                     dp[i + 1][j + 1] = dp[i][j]; // Characters match
killedBy: Edit Distance Tests Edit Distance Test 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3

[Killed] EqualityOperator
src/DP/EditDistance.js:22:21
             const c1 = word1.charAt(i);
             for (let j = 0; j < len2; j++) {
                 const c2 = word2.charAt(j);
-                if (c1 === c2) {
+                if (c1 !== c2) {
                     dp[i + 1][j + 1] = dp[i][j]; // Characters match
                 } else {
killedBy: Edit Distance Tests Edit Distance Test 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/DP/EditDistance.js:22:21
             const c1 = word1.charAt(i);
             for (let j = 0; j < len2; j++) {
                 const c2 = word2.charAt(j);
-                if (c1 === c2) {
+                if (true) {
                     dp[i + 1][j + 1] = dp[i][j]; // Characters match
                 } else {
killedBy: Edit Distance Tests Edit Distance Test 7 (long strings)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ArithmeticOperator
src/DP/EditDistance.js:23:24
             for (let j = 0; j < len2; j++) {
                 const c2 = word2.charAt(j);
                 if (c1 === c2) {
-                    dp[i + 1][j + 1] = dp[i][j]; // Characters match
+                    dp[i - 1][j + 1] = dp[i][j]; // Characters match
                 } else {
                     // Calculate the minimum of insert, delete, and replace
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: TypeError: Cannot set properties of undefined (setting '1')

[Killed] ArithmeticOperator
src/DP/EditDistance.js:23:31
             for (let j = 0; j < len2; j++) {
                 const c2 = word2.charAt(j);
                 if (c1 === c2) {
-                    dp[i + 1][j + 1] = dp[i][j]; // Characters match
+                    dp[i + 1][j - 1] = dp[i][j]; // Characters match
                 } else {
                     // Calculate the minimum of insert, delete, and replace
killedBy: Edit Distance Tests Edit Distance Test 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/DP/EditDistance.js:24:24
                 const c2 = word2.charAt(j);
                 if (c1 === c2) {
                     dp[i + 1][j + 1] = dp[i][j]; // Characters match
-                } else {
-                    // Calculate the minimum of insert, delete, and replace
-                    const replace = dp[i][j] + 1;
-                    const insert = dp[i][j + 1] + 1;
-                    const deletescript = dp[i + 1][j] + 1;
-
-                    dp[i + 1][j + 1] = Math.min(replace, Math.min(insert, deletescript));
-                }
+                } else {}
             }
         }
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] ArithmeticOperator
src/DP/EditDistance.js:26:37
                     dp[i + 1][j + 1] = dp[i][j]; // Characters match
                 } else {
                     // Calculate the minimum of insert, delete, and replace
-                    const replace = dp[i][j] + 1;
+                    const replace = dp[i][j] - 1;
                     const insert = dp[i][j + 1] + 1;
                     const deletescript = dp[i + 1][j] + 1;
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Killed] ArithmeticOperator
src/DP/EditDistance.js:27:36
                 } else {
                     // Calculate the minimum of insert, delete, and replace
                     const replace = dp[i][j] + 1;
-                    const insert = dp[i][j + 1] + 1;
+                    const insert = dp[i][j + 1] - 1;
                     const deletescript = dp[i + 1][j] + 1;
 
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: -4

[Killed] ArithmeticOperator
src/DP/EditDistance.js:27:42
                 } else {
                     // Calculate the minimum of insert, delete, and replace
                     const replace = dp[i][j] + 1;
-                    const insert = dp[i][j + 1] + 1;
+                    const insert = dp[i][j - 1] + 1;
                     const deletescript = dp[i + 1][j] + 1;
 
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: NaN

[Killed] ArithmeticOperator
src/DP/EditDistance.js:28:45
                     // Calculate the minimum of insert, delete, and replace
                     const replace = dp[i][j] + 1;
                     const insert = dp[i][j + 1] + 1;
-                    const deletescript = dp[i + 1][j] + 1;
+                    const deletescript = dp[i - 1][j] + 1;
 
                     dp[i + 1][j + 1] = Math.min(replace, Math.min(insert, deletescript));
killedBy: Edit Distance Tests Edit Distance Test 3
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArithmeticOperator
src/DP/EditDistance.js:28:42
                     // Calculate the minimum of insert, delete, and replace
                     const replace = dp[i][j] + 1;
                     const insert = dp[i][j + 1] + 1;
-                    const deletescript = dp[i + 1][j] + 1;
+                    const deletescript = dp[i + 1][j] - 1;
 
                     dp[i + 1][j + 1] = Math.min(replace, Math.min(insert, deletescript));
killedBy: Edit Distance Tests Edit Distance Test 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -2

[Killed] ArithmeticOperator
src/DP/EditDistance.js:30:24
                     const insert = dp[i][j + 1] + 1;
                     const deletescript = dp[i + 1][j] + 1;
 
-                    dp[i + 1][j + 1] = Math.min(replace, Math.min(insert, deletescript));
+                    dp[i - 1][j + 1] = Math.min(replace, Math.min(insert, deletescript));
                 }
             }
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] MethodExpression
src/DP/EditDistance.js:30:58
                     const insert = dp[i][j + 1] + 1;
                     const deletescript = dp[i + 1][j] + 1;
 
-                    dp[i + 1][j + 1] = Math.min(replace, Math.min(insert, deletescript));
+                    dp[i + 1][j + 1] = Math.min(replace, Math.max(insert, deletescript));
                 }
             }
killedBy: Edit Distance Tests Edit Distance Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5
