[Killed] BlockStatement
src/DP/LongestCommonSubsequence.js:2:23
 class LongestCommonSubsequence {
-    lcs(text1, text2) {
-        const n = text1.length;
-        const m = text2.length;
-        const dp = Array.from({ length: n + 1 }, () => Array(m + 1).fill(0));
-
-        for (let i = 1; i <= n; i++) {
-            for (let j = 1; j <= m; j++) {
-                if (text1.charAt(i - 1) === text2.charAt(j - 1)) {
-                    dp[i][j] = 1 + dp[i - 1][j - 1];
-                } else {
-                    dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
-                }
-            }
-        }
-        return dp[n][m];
-    }
+    lcs(text1, text2) {}
 }
 module.exports=LongestCommonSubsequence;
killedBy: Edit Distance Tests Test LCS 1: Partial match interleaved with mismatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ArithmeticOperator
src/DP/LongestCommonSubsequence.js:5:62
     lcs(text1, text2) {
         const n = text1.length;
         const m = text2.length;
-        const dp = Array.from({ length: n + 1 }, () => Array(m + 1).fill(0));
+        const dp = Array.from({ length: n + 1 }, () => Array(m - 1).fill(0));
 
         for (let i = 1; i <= n; i++) {
killedBy: Edit Distance Tests Test LCS 2: Completely mismatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] ArithmeticOperator
src/DP/LongestCommonSubsequence.js:5:41
     lcs(text1, text2) {
         const n = text1.length;
         const m = text2.length;
-        const dp = Array.from({ length: n + 1 }, () => Array(m + 1).fill(0));
+        const dp = Array.from({ length: n - 1 }, () => Array(m + 1).fill(0));
 
         for (let i = 1; i <= n; i++) {
killedBy: Edit Distance Tests Test LCS 1: Partial match interleaved with mismatch
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/DP/LongestCommonSubsequence.js:8:42
         const dp = Array.from({ length: n + 1 }, () => Array(m + 1).fill(0));
 
         for (let i = 1; i <= n; i++) {
-            for (let j = 1; j <= m; j++) {
-                if (text1.charAt(i - 1) === text2.charAt(j - 1)) {
-                    dp[i][j] = 1 + dp[i - 1][j - 1];
-                } else {
-                    dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
-                }
-            }
+            for (let j = 1; j <= m; j++) {}
         }
         return dp[n][m];
killedBy: Edit Distance Tests Test LCS 1: Partial match interleaved with mismatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] ConditionalExpression
src/DP/LongestCommonSubsequence.js:8:29
         const dp = Array.from({ length: n + 1 }, () => Array(m + 1).fill(0));
 
         for (let i = 1; i <= n; i++) {
-            for (let j = 1; j <= m; j++) {
+            for (let j = 1; false; j++) {
                 if (text1.charAt(i - 1) === text2.charAt(j - 1)) {
                     dp[i][j] = 1 + dp[i - 1][j - 1];
killedBy: Edit Distance Tests Test LCS 1: Partial match interleaved with mismatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] ConditionalExpression
src/DP/LongestCommonSubsequence.js:9:21
 
         for (let i = 1; i <= n; i++) {
             for (let j = 1; j <= m; j++) {
-                if (text1.charAt(i - 1) === text2.charAt(j - 1)) {
+                if (false) {
                     dp[i][j] = 1 + dp[i - 1][j - 1];
                 } else {
killedBy: Edit Distance Tests Test LCS 1: Partial match interleaved with mismatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] ConditionalExpression
src/DP/LongestCommonSubsequence.js:9:21
 
         for (let i = 1; i <= n; i++) {
             for (let j = 1; j <= m; j++) {
-                if (text1.charAt(i - 1) === text2.charAt(j - 1)) {
+                if (true) {
                     dp[i][j] = 1 + dp[i - 1][j - 1];
                 } else {
killedBy: Edit Distance Tests Test LCS 1: Partial match interleaved with mismatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 6

[Killed] ArithmeticOperator
src/DP/LongestCommonSubsequence.js:10:46
         for (let i = 1; i <= n; i++) {
             for (let j = 1; j <= m; j++) {
                 if (text1.charAt(i - 1) === text2.charAt(j - 1)) {
-                    dp[i][j] = 1 + dp[i - 1][j - 1];
+                    dp[i][j] = 1 + dp[i - 1][j + 1];
                 } else {
                     dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
killedBy: Edit Distance Tests Test LCS 1: Partial match interleaved with mismatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: NaN

[Killed] ArithmeticOperator
src/DP/LongestCommonSubsequence.js:10:39
         for (let i = 1; i <= n; i++) {
             for (let j = 1; j <= m; j++) {
                 if (text1.charAt(i - 1) === text2.charAt(j - 1)) {
-                    dp[i][j] = 1 + dp[i - 1][j - 1];
+                    dp[i][j] = 1 + dp[i + 1][j - 1];
                 } else {
                     dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
killedBy: Edit Distance Tests Test LCS 1: Partial match interleaved with mismatch
statusReason: TypeError: Cannot read properties of undefined (reading '5')

[Killed] BlockStatement
src/DP/LongestCommonSubsequence.js:11:24
             for (let j = 1; j <= m; j++) {
                 if (text1.charAt(i - 1) === text2.charAt(j - 1)) {
                     dp[i][j] = 1 + dp[i - 1][j - 1];
-                } else {
-                    dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
-                }
+                } else {}
             }
         }
killedBy: Edit Distance Tests Test LCS 1: Partial match interleaved with mismatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] ArithmeticOperator
src/DP/LongestCommonSubsequence.js:12:61
                 if (text1.charAt(i - 1) === text2.charAt(j - 1)) {
                     dp[i][j] = 1 + dp[i - 1][j - 1];
                 } else {
-                    dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
+                    dp[i][j] = Math.max(dp[i - 1][j], dp[i][j + 1]);
                 }
             }
killedBy: Edit Distance Tests Test LCS 1: Partial match interleaved with mismatch
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 2

[Killed] ArithmeticOperator
src/DP/LongestCommonSubsequence.js:12:44
                 if (text1.charAt(i - 1) === text2.charAt(j - 1)) {
                     dp[i][j] = 1 + dp[i - 1][j - 1];
                 } else {
-                    dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
+                    dp[i][j] = Math.max(dp[i + 1][j], dp[i][j - 1]);
                 }
             }
killedBy: Edit Distance Tests Test LCS 1: Partial match interleaved with mismatch
statusReason: TypeError: Cannot read properties of undefined (reading '1')
