[Killed] BlockStatement
src/DP/LongestIncreasingSubsequence.js:2:39
 class LongestIncreasingSubsequence {
-    static upperBound(arr, l, r, key) {
-        while (l < r - 1) {
-            const m = Math.floor((l + r) / 2);
-            if (arr[m] >= key) {
-                r = m;
-            } else {
-                l = m;
-            }
-        }
-        return r;
-    }
+    static upperBound(arr, l, r, key) {}
 
     static LIS(array) {
killedBy: testLISRepeatedSequences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Timeout] EqualityOperator
src/DP/LongestIncreasingSubsequence.js:3:16
 class LongestIncreasingSubsequence {
     static upperBound(arr, l, r, key) {
-        while (l < r - 1) {
+        while (l >= r - 1) {
             const m = Math.floor((l + r) / 2);
             if (arr[m] >= key) {

[Timeout] BlockStatement
src/DP/LongestIncreasingSubsequence.js:3:27
 class LongestIncreasingSubsequence {
     static upperBound(arr, l, r, key) {
-        while (l < r - 1) {
-            const m = Math.floor((l + r) / 2);
-            if (arr[m] >= key) {
-                r = m;
-            } else {
-                l = m;
-            }
-        }
+        while (l < r - 1) {}
         return r;
     }

[Timeout] ArithmeticOperator
src/DP/LongestIncreasingSubsequence.js:4:34
 class LongestIncreasingSubsequence {
     static upperBound(arr, l, r, key) {
         while (l < r - 1) {
-            const m = Math.floor((l + r) / 2);
+            const m = Math.floor((l + r) * 2);
             if (arr[m] >= key) {
                 r = m;

[Timeout] ArithmeticOperator
src/DP/LongestIncreasingSubsequence.js:4:35
 class LongestIncreasingSubsequence {
     static upperBound(arr, l, r, key) {
         while (l < r - 1) {
-            const m = Math.floor((l + r) / 2);
+            const m = Math.floor((l - r) / 2);
             if (arr[m] >= key) {
                 r = m;

[Killed] EqualityOperator
src/DP/LongestIncreasingSubsequence.js:5:17
     static upperBound(arr, l, r, key) {
         while (l < r - 1) {
             const m = Math.floor((l + r) / 2);
-            if (arr[m] >= key) {
+            if (arr[m] < key) {
                 r = m;
             } else {
killedBy: testLISRepeatedSequences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Killed] ConditionalExpression
src/DP/LongestIncreasingSubsequence.js:5:17
     static upperBound(arr, l, r, key) {
         while (l < r - 1) {
             const m = Math.floor((l + r) / 2);
-            if (arr[m] >= key) {
+            if (true) {
                 r = m;
             } else {
killedBy: testLISRepeatedSequences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Timeout] BlockStatement
src/DP/LongestIncreasingSubsequence.js:7:20
             const m = Math.floor((l + r) / 2);
             if (arr[m] >= key) {
                 r = m;
-            } else {
-                l = m;
-            }
+            } else {}
         }
         return r;

[Killed] BlockStatement
src/DP/LongestIncreasingSubsequence.js:14:23
         return r;
     }
 
-    static LIS(array) {
-        const N = array.length;
-        if (N === 0) {
-            return 0;
-        }
-
-        const tail = new Array(N);
-        let length = 1;
-
-        tail[0] = array[0];
-        for (let i = 1; i < N; i++) {
-            if (array[i] < tail[0]) {
-                tail[0] = array[i];
-            } else if (array[i] > tail[length - 1]) {
-                tail[length++] = array[i];
-            } else {
-                tail[LongestIncreasingSubsequence.upperBound(tail, -1, length - 1, array[i])] = array[i];
-            }
-        }
-
-        return length;
-    }
+    static LIS(array) {}
 
     static findLISLen(a) {
killedBy: testLIS1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
src/DP/LongestIncreasingSubsequence.js:16:13
 
     static LIS(array) {
         const N = array.length;
-        if (N === 0) {
+        if (true) {
             return 0;
         }
killedBy: testLIS2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/DP/LongestIncreasingSubsequence.js:16:13
 
     static LIS(array) {
         const N = array.length;
-        if (N === 0) {
+        if (N !== 0) {
             return 0;
         }
killedBy: testLIS1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/DP/LongestIncreasingSubsequence.js:24:25
         let length = 1;
 
         tail[0] = array[0];
-        for (let i = 1; i < N; i++) {
+        for (let i = 1; false; i++) {
             if (array[i] < tail[0]) {
                 tail[0] = array[i];
killedBy: testLIS3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
src/DP/LongestIncreasingSubsequence.js:24:37
         let length = 1;
 
         tail[0] = array[0];
-        for (let i = 1; i < N; i++) {
-            if (array[i] < tail[0]) {
-                tail[0] = array[i];
-            } else if (array[i] > tail[length - 1]) {
-                tail[length++] = array[i];
-            } else {
-                tail[LongestIncreasingSubsequence.upperBound(tail, -1, length - 1, array[i])] = array[i];
-            }
-        }
+        for (let i = 1; i < N; i++) {}
 
         return length;
killedBy: testLIS3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] EqualityOperator
src/DP/LongestIncreasingSubsequence.js:25:17
 
         tail[0] = array[0];
         for (let i = 1; i < N; i++) {
-            if (array[i] < tail[0]) {
+            if (array[i] >= tail[0]) {
                 tail[0] = array[i];
             } else if (array[i] > tail[length - 1]) {
killedBy: testLIS3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
src/DP/LongestIncreasingSubsequence.js:25:17
 
         tail[0] = array[0];
         for (let i = 1; i < N; i++) {
-            if (array[i] < tail[0]) {
+            if (true) {
                 tail[0] = array[i];
             } else if (array[i] > tail[length - 1]) {
killedBy: testLIS3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] EqualityOperator
src/DP/LongestIncreasingSubsequence.js:27:24
         for (let i = 1; i < N; i++) {
             if (array[i] < tail[0]) {
                 tail[0] = array[i];
-            } else if (array[i] > tail[length - 1]) {
+            } else if (array[i] >= tail[length - 1]) {
                 tail[length++] = array[i];
             } else {
killedBy: testLIS5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] BlockStatement
src/DP/LongestIncreasingSubsequence.js:27:53
         for (let i = 1; i < N; i++) {
             if (array[i] < tail[0]) {
                 tail[0] = array[i];
-            } else if (array[i] > tail[length - 1]) {
-                tail[length++] = array[i];
-            } else {
+            } else if (array[i] > tail[length - 1]) {} else {
                 tail[LongestIncreasingSubsequence.upperBound(tail, -1, length - 1, array[i])] = array[i];
             }
killedBy: testLIS3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] UpdateOperator
src/DP/LongestIncreasingSubsequence.js:28:22
             if (array[i] < tail[0]) {
                 tail[0] = array[i];
             } else if (array[i] > tail[length - 1]) {
-                tail[length++] = array[i];
+                tail[length--] = array[i];
             } else {
                 tail[LongestIncreasingSubsequence.upperBound(tail, -1, length - 1, array[i])] = array[i];
killedBy: testLIS3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
src/DP/LongestIncreasingSubsequence.js:29:20
                 tail[0] = array[i];
             } else if (array[i] > tail[length - 1]) {
                 tail[length++] = array[i];
-            } else {
-                tail[LongestIncreasingSubsequence.upperBound(tail, -1, length - 1, array[i])] = array[i];
-            }
+            } else {}
         }
 
killedBy: testLISRepeatedSequences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Survived] ArithmeticOperator
src/DP/LongestIncreasingSubsequence.js:30:72
             } else if (array[i] > tail[length - 1]) {
                 tail[length++] = array[i];
             } else {
-                tail[LongestIncreasingSubsequence.upperBound(tail, -1, length - 1, array[i])] = array[i];
+                tail[LongestIncreasingSubsequence.upperBound(tail, -1, length + 1, array[i])] = array[i];
             }
         }

[Survived] UnaryOperator
src/DP/LongestIncreasingSubsequence.js:30:68
             } else if (array[i] > tail[length - 1]) {
                 tail[length++] = array[i];
             } else {
-                tail[LongestIncreasingSubsequence.upperBound(tail, -1, length - 1, array[i])] = array[i];
+                tail[LongestIncreasingSubsequence.upperBound(tail, +1, length - 1, array[i])] = array[i];
             }
         }

[Killed] BlockStatement
src/DP/LongestIncreasingSubsequence.js:37:26
         return length;
     }
 
-    static findLISLen(a) {
-        const size = a.length;
-        const arr = new Array(size);
-        arr[0] = a[0];
-        let lis = 1;
-
-        for (let i = 1; i < size; i++) {
-            const index = LongestIncreasingSubsequence.binarySearchBetween(arr, lis, a[i]);
-            arr[index] = a[i];
-            if (index > lis) {
-                lis++;
-            }
-        }
-
-        return lis;
-    }
+    static findLISLen(a) {}
 
     static binarySearchBetween(t, end, key) {
killedBy: testFindLISLen2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Survived] ArrayDeclaration
src/DP/LongestIncreasingSubsequence.js:39:21
 
     static findLISLen(a) {
         const size = a.length;
-        const arr = new Array(size);
+        const arr = new Array();
         arr[0] = a[0];
         let lis = 1;

[Killed] ConditionalExpression
src/DP/LongestIncreasingSubsequence.js:43:25
         arr[0] = a[0];
         let lis = 1;
 
-        for (let i = 1; i < size; i++) {
+        for (let i = 1; false; i++) {
             const index = LongestIncreasingSubsequence.binarySearchBetween(arr, lis, a[i]);
             arr[index] = a[i];
killedBy: testFindLISLen5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] BlockStatement
src/DP/LongestIncreasingSubsequence.js:43:40
         arr[0] = a[0];
         let lis = 1;
 
-        for (let i = 1; i < size; i++) {
-            const index = LongestIncreasingSubsequence.binarySearchBetween(arr, lis, a[i]);
-            arr[index] = a[i];
-            if (index > lis) {
-                lis++;
-            }
-        }
+        for (let i = 1; i < size; i++) {}
 
         return lis;
killedBy: testFindLISLen5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ConditionalExpression
src/DP/LongestIncreasingSubsequence.js:46:17
         for (let i = 1; i < size; i++) {
             const index = LongestIncreasingSubsequence.binarySearchBetween(arr, lis, a[i]);
             arr[index] = a[i];
-            if (index > lis) {
+            if (true) {
                 lis++;
             }
killedBy: testFindLISLen3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BlockStatement
src/DP/LongestIncreasingSubsequence.js:46:30
         for (let i = 1; i < size; i++) {
             const index = LongestIncreasingSubsequence.binarySearchBetween(arr, lis, a[i]);
             arr[index] = a[i];
-            if (index > lis) {
-                lis++;
-            }
+            if (index > lis) {}
         }
 
killedBy: testFindLISLen5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] UpdateOperator
src/DP/LongestIncreasingSubsequence.js:47:17
             const index = LongestIncreasingSubsequence.binarySearchBetween(arr, lis, a[i]);
             arr[index] = a[i];
             if (index > lis) {
-                lis++;
+                lis--;
             }
         }
killedBy: testFindLISLen5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -2

[Killed] BlockStatement
src/DP/LongestIncreasingSubsequence.js:54:45
         return lis;
     }
 
-    static binarySearchBetween(t, end, key) {
-        let left = 0;
-        let right = end;
-        if (key < t[0]) {
-            return 0;
-        }
-        if (key > t[end]) {
-            return end + 1;
-        }
-        while (left < right - 1) {
-            const middle = Math.floor((left + right) / 2);
-            if (t[middle] < key) {
-                left = middle;
-            } else {
-                right = middle;
-            }
-        }
-        return right;
-    }
+    static binarySearchBetween(t, end, key) {}
 }
 
killedBy: testFindLISLen5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] EqualityOperator
src/DP/LongestIncreasingSubsequence.js:57:13
     static binarySearchBetween(t, end, key) {
         let left = 0;
         let right = end;
-        if (key < t[0]) {
+        if (key >= t[0]) {
             return 0;
         }
killedBy: testFindLISLen5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ConditionalExpression
src/DP/LongestIncreasingSubsequence.js:57:13
     static binarySearchBetween(t, end, key) {
         let left = 0;
         let right = end;
-        if (key < t[0]) {
+        if (false) {
             return 0;
         }
killedBy: testFindLISLen8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] EqualityOperator
src/DP/LongestIncreasingSubsequence.js:60:13
         if (key < t[0]) {
             return 0;
         }
-        if (key > t[end]) {
+        if (key <= t[end]) {
             return end + 1;
         }
killedBy: testFindLISLen5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2

[Killed] ConditionalExpression
src/DP/LongestIncreasingSubsequence.js:60:13
         if (key < t[0]) {
             return 0;
         }
-        if (key > t[end]) {
+        if (false) {
             return end + 1;
         }
killedBy: testFindLISLen5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ArithmeticOperator
src/DP/LongestIncreasingSubsequence.js:61:20
             return 0;
         }
         if (key > t[end]) {
-            return end + 1;
+            return end - 1;
         }
         while (left < right - 1) {
killedBy: testFindLISLen5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ConditionalExpression
src/DP/LongestIncreasingSubsequence.js:63:16
         if (key > t[end]) {
             return end + 1;
         }
-        while (left < right - 1) {
+        while (false) {
             const middle = Math.floor((left + right) / 2);
             if (t[middle] < key) {
killedBy: testFindLISLen5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Timeout] ArithmeticOperator
src/DP/LongestIncreasingSubsequence.js:63:23
         if (key > t[end]) {
             return end + 1;
         }
-        while (left < right - 1) {
+        while (left < right + 1) {
             const middle = Math.floor((left + right) / 2);
             if (t[middle] < key) {

[Timeout] ArithmeticOperator
src/DP/LongestIncreasingSubsequence.js:64:39
             return end + 1;
         }
         while (left < right - 1) {
-            const middle = Math.floor((left + right) / 2);
+            const middle = Math.floor((left + right) * 2);
             if (t[middle] < key) {
                 left = middle;

[Timeout] ArithmeticOperator
src/DP/LongestIncreasingSubsequence.js:64:40
             return end + 1;
         }
         while (left < right - 1) {
-            const middle = Math.floor((left + right) / 2);
+            const middle = Math.floor((left - right) / 2);
             if (t[middle] < key) {
                 left = middle;

[Killed] ConditionalExpression
src/DP/LongestIncreasingSubsequence.js:65:17
         }
         while (left < right - 1) {
             const middle = Math.floor((left + right) / 2);
-            if (t[middle] < key) {
+            if (true) {
                 left = middle;
             } else {
killedBy: testFindLISLen5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] EqualityOperator
src/DP/LongestIncreasingSubsequence.js:65:17
         }
         while (left < right - 1) {
             const middle = Math.floor((left + right) / 2);
-            if (t[middle] < key) {
+            if (t[middle] >= key) {
                 left = middle;
             } else {
killedBy: testFindLISLen5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Timeout] BlockStatement
src/DP/LongestIncreasingSubsequence.js:67:20
             const middle = Math.floor((left + right) / 2);
             if (t[middle] < key) {
                 left = middle;
-            } else {
-                right = middle;
-            }
+            } else {}
         }
         return right;
