[Killed] BlockStatement
src/DP/MatrixChainMultiplication.js:2:33
 class MatrixChainMultiplication {
-    static solve(arr, i, j, dp) {
-        if (i === j) return 0;
-
-        if (dp[i][j] !== -1) return dp[i][j];
-
-        let mini = Number.MAX_VALUE;
-
-        for (let k = i; k <= j - 1; k++) {
-            const ans =
-                this.solve(arr, i, k, dp) +
-                this.solve(arr, k + 1, j, dp) +
-                arr[i - 1] * arr[k] * arr[j];
-
-            mini = Math.min(mini, ans);
-        }
-
-        dp[i][j] = mini;
-        return dp[i][j];
-    }
+    static solve(arr, i, j, dp) {}
 
     static matrixMultiplication(arr, N) {
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: undefined

[Killed] EqualityOperator
src/DP/MatrixChainMultiplication.js:3:13
 class MatrixChainMultiplication {
     static solve(arr, i, j, dp) {
-        if (i === j) return 0;
+        if (i !== j) return 0;
 
         if (dp[i][j] !== -1) return dp[i][j];
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: 0

[Killed] ConditionalExpression
src/DP/MatrixChainMultiplication.js:3:13
 class MatrixChainMultiplication {
     static solve(arr, i, j, dp) {
-        if (i === j) return 0;
+        if (true) return 0;
 
         if (dp[i][j] !== -1) return dp[i][j];
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: 0

[Killed] EqualityOperator
src/DP/MatrixChainMultiplication.js:5:13
     static solve(arr, i, j, dp) {
         if (i === j) return 0;
 
-        if (dp[i][j] !== -1) return dp[i][j];
+        if (dp[i][j] === -1) return dp[i][j];
 
         let mini = Number.MAX_VALUE;
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: -1

[Killed] ConditionalExpression
src/DP/MatrixChainMultiplication.js:5:13
     static solve(arr, i, j, dp) {
         if (i === j) return 0;
 
-        if (dp[i][j] !== -1) return dp[i][j];
+        if (true) return dp[i][j];
 
         let mini = Number.MAX_VALUE;
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: -1

[Killed] BlockStatement
src/DP/MatrixChainMultiplication.js:9:42
 
         let mini = Number.MAX_VALUE;
 
-        for (let k = i; k <= j - 1; k++) {
-            const ans =
-                this.solve(arr, i, k, dp) +
-                this.solve(arr, k + 1, j, dp) +
-                arr[i - 1] * arr[k] * arr[j];
-
-            mini = Math.min(mini, ans);
-        }
+        for (let k = i; k <= j - 1; k++) {}
 
         dp[i][j] = mini;
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: 1.7976931348623157e+308

[Killed] ConditionalExpression
src/DP/MatrixChainMultiplication.js:9:25
 
         let mini = Number.MAX_VALUE;
 
-        for (let k = i; k <= j - 1; k++) {
+        for (let k = i; false; k++) {
             const ans =
                 this.solve(arr, i, k, dp) +
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: 1.7976931348623157e+308

[Killed] ArithmeticOperator
src/DP/MatrixChainMultiplication.js:11:17
 
         for (let k = i; k <= j - 1; k++) {
             const ans =
-                this.solve(arr, i, k, dp) +
-                this.solve(arr, k + 1, j, dp) +
-                arr[i - 1] * arr[k] * arr[j];
+                this.solve(arr, i, k, dp) + this.solve(arr, k + 1, j, dp) - arr[i - 1] * arr[k] * arr[j];
 
             mini = Math.min(mini, ans);
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: -6000

[Killed] ArithmeticOperator
src/DP/MatrixChainMultiplication.js:11:17
 
         for (let k = i; k <= j - 1; k++) {
             const ans =
-                this.solve(arr, i, k, dp) +
-                this.solve(arr, k + 1, j, dp) +
+                this.solve(arr, i, k, dp) - this.solve(arr, k + 1, j, dp) +
                 arr[i - 1] * arr[k] * arr[j];
 
killedBy: Test Case 2: Chain with 3 matrices
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 18000
Received: -16000

[Killed] ArithmeticOperator
src/DP/MatrixChainMultiplication.js:12:33
         for (let k = i; k <= j - 1; k++) {
             const ans =
                 this.solve(arr, i, k, dp) +
-                this.solve(arr, k + 1, j, dp) +
+                this.solve(arr, k - 1, j, dp) +
                 arr[i - 1] * arr[k] * arr[j];
 
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: TypeError: Cannot read properties of undefined (reading '2')

[Killed] ArithmeticOperator
src/DP/MatrixChainMultiplication.js:13:17
             const ans =
                 this.solve(arr, i, k, dp) +
                 this.solve(arr, k + 1, j, dp) +
-                arr[i - 1] * arr[k] * arr[j];
+                arr[i - 1] * arr[k] / arr[j];
 
             mini = Math.min(mini, ans);
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: 6.666666666666667

[Killed] ArithmeticOperator
src/DP/MatrixChainMultiplication.js:13:17
             const ans =
                 this.solve(arr, i, k, dp) +
                 this.solve(arr, k + 1, j, dp) +
-                arr[i - 1] * arr[k] * arr[j];
+                arr[i - 1] / arr[k] * arr[j];
 
             mini = Math.min(mini, ans);
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: 15

[Killed] MethodExpression
src/DP/MatrixChainMultiplication.js:15:20
                 this.solve(arr, k + 1, j, dp) +
                 arr[i - 1] * arr[k] * arr[j];
 
-            mini = Math.min(mini, ans);
+            mini = Math.max(mini, ans);
         }
 
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: 1.7976931348623157e+308

[Killed] BlockStatement
src/DP/MatrixChainMultiplication.js:22:41
         return dp[i][j];
     }
 
-    static matrixMultiplication(arr, N) {
-        const dp = Array.from({ length: N }, () => Array(N).fill(-1));
-        const i = 1;
-        const j = N - 1;
-        return this.solve(arr, i, j, dp);
-    }
+    static matrixMultiplication(arr, N) {}
 }
 
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: undefined

[Killed] UnaryOperator
src/DP/MatrixChainMultiplication.js:23:66
     }
 
     static matrixMultiplication(arr, N) {
-        const dp = Array.from({ length: N }, () => Array(N).fill(-1));
+        const dp = Array.from({ length: N }, () => Array(N).fill(+1));
         const i = 1;
         const j = N - 1;
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: 1

[Killed] ArrowFunction
src/DP/MatrixChainMultiplication.js:23:46
     }
 
     static matrixMultiplication(arr, N) {
-        const dp = Array.from({ length: N }, () => Array(N).fill(-1));
+        const dp = Array.from({ length: N }, () => undefined);
         const i = 1;
         const j = N - 1;
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: TypeError: Cannot read properties of undefined (reading '2')

[Killed] ArithmeticOperator
src/DP/MatrixChainMultiplication.js:25:19
     static matrixMultiplication(arr, N) {
         const dp = Array.from({ length: N }, () => Array(N).fill(-1));
         const i = 1;
-        const j = N - 1;
+        const j = N + 1;
         return this.solve(arr, i, j, dp);
     }
killedBy: Test Case 1: Single multiplication (2 matrices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6000
Received: undefined
