[Killed] ArrowFunction
src/DP/PalindromePartitioning.js:6:58
         const len = word.length;
 
         const minCuts = new Array(len).fill(0);
-        const isPalindrome = Array.from({ length: len }, () => new Array(len).fill(false));
+        const isPalindrome = Array.from({ length: len }, () => undefined);
 
         // Single character substrings are palindromes
killedBy: Palindrome Partitioning Tests Test Case 2: Single character string
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Survived] BooleanLiteral
src/DP/PalindromePartitioning.js:6:84
         const len = word.length;
 
         const minCuts = new Array(len).fill(0);
-        const isPalindrome = Array.from({ length: len }, () => new Array(len).fill(false));
+        const isPalindrome = Array.from({ length: len }, () => new Array(len).fill(true));
 
         // Single character substrings are palindromes

[Killed] UpdateOperator
src/DP/PalindromePartitioning.js:9:34
         const isPalindrome = Array.from({ length: len }, () => new Array(len).fill(false));
 
         // Single character substrings are palindromes
-        for (let i = 0; i < len; i++) {
+        for (let i = 0; i < len; i--) {
             isPalindrome[i][i] = true;
         }
killedBy: Palindrome Partitioning Tests Test Case 2: Single character string
statusReason: TypeError: Cannot set properties of undefined (setting '-1')

[Killed] ConditionalExpression
src/DP/PalindromePartitioning.js:9:25
         const isPalindrome = Array.from({ length: len }, () => new Array(len).fill(false));
 
         // Single character substrings are palindromes
-        for (let i = 0; i < len; i++) {
+        for (let i = 0; false; i++) {
             isPalindrome[i][i] = true;
         }
killedBy: Palindrome Partitioning Tests Test Case 2: Single character string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: Infinity

[Killed] BooleanLiteral
src/DP/PalindromePartitioning.js:10:34
 
         // Single character substrings are palindromes
         for (let i = 0; i < len; i++) {
-            isPalindrome[i][i] = true;
+            isPalindrome[i][i] = false;
         }
 
killedBy: Palindrome Partitioning Tests Test Case 2: Single character string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: Infinity

[Killed] EqualityOperator
src/DP/PalindromePartitioning.js:14:25
         }
 
         // Build the solution in a bottom-up manner
-        for (let L = 2; L <= len; L++) {
+        for (let L = 2; L < len; L++) {
             for (let i = 0; i < len - L + 1; i++) {
                 const j = i + L - 1;
killedBy: Palindrome Partitioning Tests Test Case 3: Two-character palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/DP/PalindromePartitioning.js:14:25
         }
 
         // Build the solution in a bottom-up manner
-        for (let L = 2; L <= len; L++) {
+        for (let L = 2; false; L++) {
             for (let i = 0; i < len - L + 1; i++) {
                 const j = i + L - 1;
killedBy: Palindrome Partitioning Tests Test Case 3: Two-character palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] UpdateOperator
src/DP/PalindromePartitioning.js:15:46
 
         // Build the solution in a bottom-up manner
         for (let L = 2; L <= len; L++) {
-            for (let i = 0; i < len - L + 1; i++) {
+            for (let i = 0; i < len - L + 1; i--) {
                 const j = i + L - 1;
 
killedBy: Palindrome Partitioning Tests Test Case 3: Two-character palindrome
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Killed] EqualityOperator
src/DP/PalindromePartitioning.js:15:29
 
         // Build the solution in a bottom-up manner
         for (let L = 2; L <= len; L++) {
-            for (let i = 0; i < len - L + 1; i++) {
+            for (let i = 0; i >= len - L + 1; i++) {
                 const j = i + L - 1;
 
killedBy: Palindrome Partitioning Tests Test Case 3: Two-character palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ArithmeticOperator
src/DP/PalindromePartitioning.js:16:27
         // Build the solution in a bottom-up manner
         for (let L = 2; L <= len; L++) {
             for (let i = 0; i < len - L + 1; i++) {
-                const j = i + L - 1;
+                const j = i + L + 1;
 
                 if (L === 2) {
killedBy: Palindrome Partitioning Tests Test Case 3: Two-character palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ArithmeticOperator
src/DP/PalindromePartitioning.js:16:27
         // Build the solution in a bottom-up manner
         for (let L = 2; L <= len; L++) {
             for (let i = 0; i < len - L + 1; i++) {
-                const j = i + L - 1;
+                const j = i - L - 1;
 
                 if (L === 2) {
killedBy: Palindrome Partitioning Tests Test Case 3: Two-character palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/DP/PalindromePartitioning.js:18:21
             for (let i = 0; i < len - L + 1; i++) {
                 const j = i + L - 1;
 
-                if (L === 2) {
+                if (false) {
                     isPalindrome[i][j] = (word[i] === word[j]);
                 } else {
killedBy: Palindrome Partitioning Tests Test Case 3: Two-character palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/DP/PalindromePartitioning.js:18:30
             for (let i = 0; i < len - L + 1; i++) {
                 const j = i + L - 1;
 
-                if (L === 2) {
-                    isPalindrome[i][j] = (word[i] === word[j]);
-                } else {
+                if (L === 2) {} else {
                     isPalindrome[i][j] = (word[i] === word[j]) && isPalindrome[i + 1][j - 1];
                 }
killedBy: Palindrome Partitioning Tests Test Case 3: Two-character palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/DP/PalindromePartitioning.js:19:43
                 const j = i + L - 1;
 
                 if (L === 2) {
-                    isPalindrome[i][j] = (word[i] === word[j]);
+                    isPalindrome[i][j] = (false);
                 } else {
                     isPalindrome[i][j] = (word[i] === word[j]) && isPalindrome[i + 1][j - 1];
killedBy: Palindrome Partitioning Tests Test Case 3: Two-character palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
src/DP/PalindromePartitioning.js:19:43
                 const j = i + L - 1;
 
                 if (L === 2) {
-                    isPalindrome[i][j] = (word[i] === word[j]);
+                    isPalindrome[i][j] = (word[i] !== word[j]);
                 } else {
                     isPalindrome[i][j] = (word[i] === word[j]) && isPalindrome[i + 1][j - 1];
killedBy: Palindrome Partitioning Tests Test Case 3: Two-character palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/DP/PalindromePartitioning.js:20:24
 
                 if (L === 2) {
                     isPalindrome[i][j] = (word[i] === word[j]);
-                } else {
-                    isPalindrome[i][j] = (word[i] === word[j]) && isPalindrome[i + 1][j - 1];
-                }
+                } else {}
             }
         }
killedBy: Palindrome Partitioning Tests Test Case 4: Odd-length palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] ConditionalExpression
src/DP/PalindromePartitioning.js:21:42
                 if (L === 2) {
                     isPalindrome[i][j] = (word[i] === word[j]);
                 } else {
-                    isPalindrome[i][j] = (word[i] === word[j]) && isPalindrome[i + 1][j - 1];
+                    isPalindrome[i][j] = true;
                 }
             }
killedBy: Palindrome Partitioning Tests Test Case 6: Mixed string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] LogicalOperator
src/DP/PalindromePartitioning.js:21:42
                 if (L === 2) {
                     isPalindrome[i][j] = (word[i] === word[j]);
                 } else {
-                    isPalindrome[i][j] = (word[i] === word[j]) && isPalindrome[i + 1][j - 1];
+                    isPalindrome[i][j] = word[i] === word[j] || isPalindrome[i + 1][j - 1];
                 }
             }
killedBy: Palindrome Partitioning Tests Test Case 6: Mixed string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ConditionalExpression
src/DP/PalindromePartitioning.js:26:25
             }
         }
 
-        for (let i = 0; i < len; i++) {
+        for (let i = 0; false; i++) {
             if (isPalindrome[0][i]) {
                 minCuts[i] = 0;
killedBy: Palindrome Partitioning Tests Test Case 5: Two-character non-palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/DP/PalindromePartitioning.js:26:25
             }
         }
 
-        for (let i = 0; i < len; i++) {
+        for (let i = 0; i <= len; i++) {
             if (isPalindrome[0][i]) {
                 minCuts[i] = 0;
killedBy: Palindrome Partitioning Tests Test Case 2: Single character string
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] ConditionalExpression
src/DP/PalindromePartitioning.js:27:17
         }
 
         for (let i = 0; i < len; i++) {
-            if (isPalindrome[0][i]) {
+            if (false) {
                 minCuts[i] = 0;
             } else {
killedBy: Palindrome Partitioning Tests Test Case 2: Single character string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: Infinity

[Killed] ConditionalExpression
src/DP/PalindromePartitioning.js:27:17
         }
 
         for (let i = 0; i < len; i++) {
-            if (isPalindrome[0][i]) {
+            if (true) {
                 minCuts[i] = 0;
             } else {
killedBy: Palindrome Partitioning Tests Test Case 5: Two-character non-palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/DP/PalindromePartitioning.js:29:20
         for (let i = 0; i < len; i++) {
             if (isPalindrome[0][i]) {
                 minCuts[i] = 0;
-            } else {
-                minCuts[i] = Infinity;
-                for (let j = 0; j < i; j++) {
-                    if (isPalindrome[j + 1][i] && 1 + minCuts[j] < minCuts[i]) {
-                        minCuts[i] = 1 + minCuts[j];
-                    }
-                }
-            }
+            } else {}
         }
 
killedBy: Palindrome Partitioning Tests Test Case 5: Two-character non-palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/DP/PalindromePartitioning.js:31:33
                 minCuts[i] = 0;
             } else {
                 minCuts[i] = Infinity;
-                for (let j = 0; j < i; j++) {
+                for (let j = 0; false; j++) {
                     if (isPalindrome[j + 1][i] && 1 + minCuts[j] < minCuts[i]) {
                         minCuts[i] = 1 + minCuts[j];
killedBy: Palindrome Partitioning Tests Test Case 5: Two-character non-palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: Infinity

[Killed] EqualityOperator
src/DP/PalindromePartitioning.js:31:33
                 minCuts[i] = 0;
             } else {
                 minCuts[i] = Infinity;
-                for (let j = 0; j < i; j++) {
+                for (let j = 0; j <= i; j++) {
                     if (isPalindrome[j + 1][i] && 1 + minCuts[j] < minCuts[i]) {
                         minCuts[i] = 1 + minCuts[j];
killedBy: Palindrome Partitioning Tests Test Case 5: Two-character non-palindrome
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] ConditionalExpression
src/DP/PalindromePartitioning.js:32:25
             } else {
                 minCuts[i] = Infinity;
                 for (let j = 0; j < i; j++) {
-                    if (isPalindrome[j + 1][i] && 1 + minCuts[j] < minCuts[i]) {
+                    if (true) {
                         minCuts[i] = 1 + minCuts[j];
                     }
killedBy: Palindrome Partitioning Tests Test Case 6: Mixed string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 5

[Killed] EqualityOperator
src/DP/PalindromePartitioning.js:32:51
             } else {
                 minCuts[i] = Infinity;
                 for (let j = 0; j < i; j++) {
-                    if (isPalindrome[j + 1][i] && 1 + minCuts[j] < minCuts[i]) {
+                    if (isPalindrome[j + 1][i] && 1 + minCuts[j] >= minCuts[i]) {
                         minCuts[i] = 1 + minCuts[j];
                     }
killedBy: Palindrome Partitioning Tests Test Case 5: Two-character non-palindrome
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: Infinity

[Killed] ArithmeticOperator
src/DP/PalindromePartitioning.js:33:38
                 minCuts[i] = Infinity;
                 for (let j = 0; j < i; j++) {
                     if (isPalindrome[j + 1][i] && 1 + minCuts[j] < minCuts[i]) {
-                        minCuts[i] = 1 + minCuts[j];
+                        minCuts[i] = 1 - minCuts[j];
                     }
                 }
killedBy: Palindrome Partitioning Tests Test Case 6: Mixed string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ArithmeticOperator
src/DP/PalindromePartitioning.js:39:24
             }
         }
 
-        return minCuts[len - 1];
+        return minCuts[len + 1];
     }
 }
killedBy: Palindrome Partitioning Tests Test Case 2: Single character string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined
