[Killed] BlockStatement
src/DP/RodCutting.js:2:29
 class RodCutting {
-    static cutRod(price, n) {
-        const val = new Array(n + 1).fill(0);
-
-        for (let i = 1; i <= n; i++) {
-            let max_val = Number.MIN_SAFE_INTEGER;
-            for (let j = 0; j < i; j++) {
-                max_val = Math.max(max_val, price[j] + val[i - j - 1]);
-            }
-            val[i] = max_val;
-        }
-
-        return val[n];
-    }
+    static cutRod(price, n) {}
 }
 
killedBy: Rod Cutting Tests Test Case 1: Single length rod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
src/DP/RodCutting.js:3:31
 class RodCutting {
     static cutRod(price, n) {
-        const val = new Array(n + 1).fill(0);
+        const val = new Array(n - 1).fill(0);
 
         for (let i = 1; i <= n; i++) {
killedBy: Rod Cutting Tests Test Case 1: Single length rod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: NaN

[Killed] ArrayDeclaration
src/DP/RodCutting.js:3:21
 class RodCutting {
     static cutRod(price, n) {
-        const val = new Array(n + 1).fill(0);
+        const val = new Array().fill(0);
 
         for (let i = 1; i <= n; i++) {
killedBy: Rod Cutting Tests Test Case 1: Single length rod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: NaN

[Killed] BlockStatement
src/DP/RodCutting.js:5:38
     static cutRod(price, n) {
         const val = new Array(n + 1).fill(0);
 
-        for (let i = 1; i <= n; i++) {
-            let max_val = Number.MIN_SAFE_INTEGER;
-            for (let j = 0; j < i; j++) {
-                max_val = Math.max(max_val, price[j] + val[i - j - 1]);
-            }
-            val[i] = max_val;
-        }
+        for (let i = 1; i <= n; i++) {}
 
         return val[n];
killedBy: Rod Cutting Tests Test Case 1: Single length rod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] EqualityOperator
src/DP/RodCutting.js:7:29
 
         for (let i = 1; i <= n; i++) {
             let max_val = Number.MIN_SAFE_INTEGER;
-            for (let j = 0; j < i; j++) {
+            for (let j = 0; j >= i; j++) {
                 max_val = Math.max(max_val, price[j] + val[i - j - 1]);
             }
killedBy: Rod Cutting Tests Test Case 1: Single length rod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -9007199254740991

[Killed] BlockStatement
src/DP/RodCutting.js:7:41
 
         for (let i = 1; i <= n; i++) {
             let max_val = Number.MIN_SAFE_INTEGER;
-            for (let j = 0; j < i; j++) {
-                max_val = Math.max(max_val, price[j] + val[i - j - 1]);
-            }
+            for (let j = 0; j < i; j++) {}
             val[i] = max_val;
         }
killedBy: Rod Cutting Tests Test Case 1: Single length rod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -9007199254740991

[Killed] ArithmeticOperator
src/DP/RodCutting.js:8:45
         for (let i = 1; i <= n; i++) {
             let max_val = Number.MIN_SAFE_INTEGER;
             for (let j = 0; j < i; j++) {
-                max_val = Math.max(max_val, price[j] + val[i - j - 1]);
+                max_val = Math.max(max_val, price[j] - val[i - j - 1]);
             }
             val[i] = max_val;
killedBy: Rod Cutting Tests Test Case 2: Multiple lengths, full cut
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 22
Received: 20

[Killed] MethodExpression
src/DP/RodCutting.js:8:27
         for (let i = 1; i <= n; i++) {
             let max_val = Number.MIN_SAFE_INTEGER;
             for (let j = 0; j < i; j++) {
-                max_val = Math.max(max_val, price[j] + val[i - j - 1]);
+                max_val = Math.min(max_val, price[j] + val[i - j - 1]);
             }
             val[i] = max_val;
killedBy: Rod Cutting Tests Test Case 1: Single length rod
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -9007199254740991
