[Killed] BlockStatement
src/DP/ShortestCommonSpersequence.js:2:52
 class ShortestCommonSupersequence {
-    static shortestCommonSupersequence(str1, str2) {
-        const n = str1.length;
-        const m = str2.length;
-        return this.solve(n, m, str1, str2);
-    }
+    static shortestCommonSupersequence(str1, str2) {}
 
     static solve(n, m, s1, s2) {
killedBy: Test Case 1: No characters in common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdef"
Received: undefined

[Killed] ArithmeticOperator
src/DP/ShortestCommonSpersequence.js:9:66
     }
 
     static solve(n, m, s1, s2) {
-        const dp = Array.from({ length: n + 1 }, () => new Array(m + 1).fill(0));
+        const dp = Array.from({ length: n + 1 }, () => new Array(m - 1).fill(0));
 
         // Build the DP table
killedBy: Test Case 5: One string is empty
statusReason: RangeError: Invalid array length

[Killed] ArrowFunction
src/DP/ShortestCommonSpersequence.js:9:50
     }
 
     static solve(n, m, s1, s2) {
-        const dp = Array.from({ length: n + 1 }, () => new Array(m + 1).fill(0));
+        const dp = Array.from({ length: n + 1 }, () => undefined);
 
         // Build the DP table
killedBy: Test Case 1: No characters in common
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] ConditionalExpression
src/DP/ShortestCommonSpersequence.js:12:25
         const dp = Array.from({ length: n + 1 }, () => new Array(m + 1).fill(0));
 
         // Build the DP table
-        for (let i = 1; i <= n; i++) {
+        for (let i = 1; false; i++) {
             for (let j = 1; j <= m; j++) {
                 if (s1[i - 1] === s2[j - 1]) {
killedBy: Test Case 3: Interleaved characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "aebcd"
Received: "abcebd"

[Killed] BlockStatement
src/DP/ShortestCommonSpersequence.js:12:38
         const dp = Array.from({ length: n + 1 }, () => new Array(m + 1).fill(0));
 
         // Build the DP table
-        for (let i = 1; i <= n; i++) {
-            for (let j = 1; j <= m; j++) {
-                if (s1[i - 1] === s2[j - 1]) {
-                    dp[i][j] = 1 + dp[i - 1][j - 1];
-                } else {
-                    dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
-                }
-            }
-        }
+        for (let i = 1; i <= n; i++) {}
 
         // Trace back the shortest common supersequence
killedBy: Test Case 3: Interleaved characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "aebcd"
Received: "abcebd"

[Killed] EqualityOperator
src/DP/ShortestCommonSpersequence.js:13:29
 
         // Build the DP table
         for (let i = 1; i <= n; i++) {
-            for (let j = 1; j <= m; j++) {
+            for (let j = 1; j < m; j++) {
                 if (s1[i - 1] === s2[j - 1]) {
                     dp[i][j] = 1 + dp[i - 1][j - 1];
killedBy: Test Case 8: One string is a subsequence of the other
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abc"
Received: "abcb"

[Killed] ArithmeticOperator
src/DP/ShortestCommonSpersequence.js:14:38
         // Build the DP table
         for (let i = 1; i <= n; i++) {
             for (let j = 1; j <= m; j++) {
-                if (s1[i - 1] === s2[j - 1]) {
+                if (s1[i - 1] === s2[j + 1]) {
                     dp[i][j] = 1 + dp[i - 1][j - 1];
                 } else {
killedBy: Test Case 3: Interleaved characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "aebcd"
Received: "abcebd"

[Killed] ArithmeticOperator
src/DP/ShortestCommonSpersequence.js:14:24
         // Build the DP table
         for (let i = 1; i <= n; i++) {
             for (let j = 1; j <= m; j++) {
-                if (s1[i - 1] === s2[j - 1]) {
+                if (s1[i + 1] === s2[j - 1]) {
                     dp[i][j] = 1 + dp[i - 1][j - 1];
                 } else {
killedBy: Test Case 3: Interleaved characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "aebcd"
Received: "abcebd"

[Killed] ArithmeticOperator
src/DP/ShortestCommonSpersequence.js:15:39
         for (let i = 1; i <= n; i++) {
             for (let j = 1; j <= m; j++) {
                 if (s1[i - 1] === s2[j - 1]) {
-                    dp[i][j] = 1 + dp[i - 1][j - 1];
+                    dp[i][j] = 1 + dp[i + 1][j - 1];
                 } else {
                     dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
killedBy: Test Case 2: Identical strings
statusReason: TypeError: Cannot read properties of undefined (reading '2')

[Killed] ArithmeticOperator
src/DP/ShortestCommonSpersequence.js:15:32
         for (let i = 1; i <= n; i++) {
             for (let j = 1; j <= m; j++) {
                 if (s1[i - 1] === s2[j - 1]) {
-                    dp[i][j] = 1 + dp[i - 1][j - 1];
+                    dp[i][j] = 1 - dp[i - 1][j - 1];
                 } else {
                     dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
killedBy: Test Case 8: One string is a subsequence of the other
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abc"
Received: "abcb"

[Survived] MethodExpression
src/DP/ShortestCommonSpersequence.js:17:32
                 if (s1[i - 1] === s2[j - 1]) {
                     dp[i][j] = 1 + dp[i - 1][j - 1];
                 } else {
-                    dp[i][j] = Math.max(dp[i - 1][j], dp[i][j - 1]);
+                    dp[i][j] = Math.min(dp[i - 1][j], dp[i][j - 1]);
                 }
             }

[Killed] ArrayDeclaration
src/DP/ShortestCommonSpersequence.js:24:24
 
         // Trace back the shortest common supersequence
         let i = n, j = m;
-        const result = [];
+        const result = ["Stryker was here"];
 
         while (i > 0 && j > 0) {
killedBy: Test Case 1: No characters in common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdef"
Received: "abcdefStryker was here"

[Killed] EqualityOperator
src/DP/ShortestCommonSpersequence.js:26:16
         let i = n, j = m;
         const result = [];
 
-        while (i > 0 && j > 0) {
+        while (i >= 0 && j > 0) {
             if (s1[i - 1] === s2[j - 1]) {
                 result.push(s1[i - 1]);
killedBy: Test Case 5: One string is empty
statusReason: TypeError: Cannot read properties of undefined (reading '3')

[Killed] ConditionalExpression
src/DP/ShortestCommonSpersequence.js:26:16
         let i = n, j = m;
         const result = [];
 
-        while (i > 0 && j > 0) {
+        while (false) {
             if (s1[i - 1] === s2[j - 1]) {
                 result.push(s1[i - 1]);
killedBy: Test Case 1: No characters in common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdef"
Received: "defabc"

[Killed] ConditionalExpression
src/DP/ShortestCommonSpersequence.js:27:17
         const result = [];
 
         while (i > 0 && j > 0) {
-            if (s1[i - 1] === s2[j - 1]) {
+            if (false) {
                 result.push(s1[i - 1]);
                 i--;
killedBy: Test Case 2: Identical strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abc"
Received: "aabbcc"

[Killed] EqualityOperator
src/DP/ShortestCommonSpersequence.js:27:17
         const result = [];
 
         while (i > 0 && j > 0) {
-            if (s1[i - 1] === s2[j - 1]) {
+            if (s1[i - 1] !== s2[j - 1]) {
                 result.push(s1[i - 1]);
                 i--;
killedBy: Test Case 1: No characters in common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdef"
Received: "abc"

[Killed] ArithmeticOperator
src/DP/ShortestCommonSpersequence.js:28:32
 
         while (i > 0 && j > 0) {
             if (s1[i - 1] === s2[j - 1]) {
-                result.push(s1[i - 1]);
+                result.push(s1[i + 1]);
                 i--;
                 j--;
killedBy: Test Case 2: Identical strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abc"
Received: "c"

[Killed] UpdateOperator
src/DP/ShortestCommonSpersequence.js:29:17
         while (i > 0 && j > 0) {
             if (s1[i - 1] === s2[j - 1]) {
                 result.push(s1[i - 1]);
-                i--;
+                i++;
                 j--;
             } else if (dp[i - 1][j] > dp[i][j - 1]) {
killedBy: Test Case 2: Identical strings
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] UpdateOperator
src/DP/ShortestCommonSpersequence.js:30:17
             if (s1[i - 1] === s2[j - 1]) {
                 result.push(s1[i - 1]);
                 i--;
-                j--;
+                j++;
             } else if (dp[i - 1][j] > dp[i][j - 1]) {
                 result.push(s1[i - 1]);
killedBy: Test Case 2: Identical strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abc"
Received: "ababcbcc"

[Killed] ConditionalExpression
src/DP/ShortestCommonSpersequence.js:31:24
                 result.push(s1[i - 1]);
                 i--;
                 j--;
-            } else if (dp[i - 1][j] > dp[i][j - 1]) {
+            } else if (true) {
                 result.push(s1[i - 1]);
                 i--;
killedBy: Test Case 1: No characters in common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdef"
Received: "defabc"

[Killed] ArithmeticOperator
src/DP/ShortestCommonSpersequence.js:31:27
                 result.push(s1[i - 1]);
                 i--;
                 j--;
-            } else if (dp[i - 1][j] > dp[i][j - 1]) {
+            } else if (dp[i + 1][j] > dp[i][j - 1]) {
                 result.push(s1[i - 1]);
                 i--;
killedBy: Test Case 1: No characters in common
statusReason: TypeError: Cannot read properties of undefined (reading '3')

[Killed] ArithmeticOperator
src/DP/ShortestCommonSpersequence.js:32:32
                 i--;
                 j--;
             } else if (dp[i - 1][j] > dp[i][j - 1]) {
-                result.push(s1[i - 1]);
+                result.push(s1[i + 1]);
                 i--;
             } else {
killedBy: Test Case 3: Interleaved characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "aebcd"
Received: "aebd"

[Timeout] BlockStatement
src/DP/ShortestCommonSpersequence.js:34:20
             } else if (dp[i - 1][j] > dp[i][j - 1]) {
                 result.push(s1[i - 1]);
                 i--;
-            } else {
-                result.push(s2[j - 1]);
-                j--;
-            }
+            } else {}
         }
 

[Killed] ArithmeticOperator
src/DP/ShortestCommonSpersequence.js:35:32
                 result.push(s1[i - 1]);
                 i--;
             } else {
-                result.push(s2[j - 1]);
+                result.push(s2[j + 1]);
                 j--;
             }
killedBy: Test Case 1: No characters in common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdef"
Received: "abcf"

[Timeout] UpdateOperator
src/DP/ShortestCommonSpersequence.js:36:17
                 i--;
             } else {
                 result.push(s2[j - 1]);
-                j--;
+                j++;
             }
         }

[Killed] ConditionalExpression
src/DP/ShortestCommonSpersequence.js:41:16
         }
 
         // Append remaining characters of s1 and s2
-        while (i > 0) {
+        while (false) {
             result.push(s1[i - 1]);
             i--;
killedBy: Test Case 1: No characters in common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdef"
Received: "def"

[Timeout] BlockStatement
src/DP/ShortestCommonSpersequence.js:41:23
         }
 
         // Append remaining characters of s1 and s2
-        while (i > 0) {
-            result.push(s1[i - 1]);
-            i--;
-        }
+        while (i > 0) {}
         while (j > 0) {
             result.push(s2[j - 1]);

[Killed] ArithmeticOperator
src/DP/ShortestCommonSpersequence.js:42:28
 
         // Append remaining characters of s1 and s2
         while (i > 0) {
-            result.push(s1[i - 1]);
+            result.push(s1[i + 1]);
             i--;
         }
killedBy: Test Case 1: No characters in common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdef"
Received: "cdef"

[Killed] ConditionalExpression
src/DP/ShortestCommonSpersequence.js:45:16
             result.push(s1[i - 1]);
             i--;
         }
-        while (j > 0) {
+        while (false) {
             result.push(s2[j - 1]);
             j--;
killedBy: Test Case 5: One string is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abc"
Received: ""

[Timeout] BlockStatement
src/DP/ShortestCommonSpersequence.js:45:23
             result.push(s1[i - 1]);
             i--;
         }
-        while (j > 0) {
-            result.push(s2[j - 1]);
-            j--;
-        }
+        while (j > 0) {}
 
         return result.reverse().join('');

[Killed] ArithmeticOperator
src/DP/ShortestCommonSpersequence.js:46:28
             i--;
         }
         while (j > 0) {
-            result.push(s2[j - 1]);
+            result.push(s2[j + 1]);
             j--;
         }
killedBy: Test Case 5: One string is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abc"
Received: "c"

[Killed] MethodExpression
src/DP/ShortestCommonSpersequence.js:50:16
             j--;
         }
 
-        return result.reverse().join('');
+        return result.join('');
     }
 }
killedBy: Test Case 1: No characters in common
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdef"
Received: "fedcba"
