[Killed] BlockStatement
src/DP/StockBuyAndSell.js:2:40
 class StockBuyAndSell {
-    static getMaximumProfit(prices, n) {
-        const dp = Array.from({ length: n + 1 }, () => Array(2).fill(0));
-
-        // Base case: no profit possible if we're past the last day
-        dp[n][0] = dp[n][1] = 0;
-
-        for (let ind = n - 1; ind >= 0; ind--) {
-            for (let buy = 0; buy <= 1; buy++) {
-                if (buy === 0) {
-                    dp[ind][buy] = Math.max(0 + dp[ind + 1][0], -prices[ind] + dp[ind + 1][1]);
-                } else {
-                    dp[ind][buy] = Math.max(0 + dp[ind + 1][1], prices[ind] + dp[ind + 1][0]);
-                }
-            }
-        }
-
-        return dp[0][0];
-    }
+    static getMaximumProfit(prices, n) {}
 }
 module.exports=StockBuyAndSell;
killedBy: Test Case 1: Profitable scenario (ascending prices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ArrowFunction
src/DP/StockBuyAndSell.js:3:50
 class StockBuyAndSell {
     static getMaximumProfit(prices, n) {
-        const dp = Array.from({ length: n + 1 }, () => Array(2).fill(0));
+        const dp = Array.from({ length: n + 1 }, () => undefined);
 
         // Base case: no profit possible if we're past the last day
killedBy: Test Case 1: Profitable scenario (ascending prices)
statusReason: TypeError: Cannot set properties of undefined (setting '1')

[Killed] ArithmeticOperator
src/DP/StockBuyAndSell.js:3:41
 class StockBuyAndSell {
     static getMaximumProfit(prices, n) {
-        const dp = Array.from({ length: n + 1 }, () => Array(2).fill(0));
+        const dp = Array.from({ length: n - 1 }, () => Array(2).fill(0));
 
         // Base case: no profit possible if we're past the last day
killedBy: Test Case 1: Profitable scenario (ascending prices)
statusReason: TypeError: Cannot set properties of undefined (setting '1')

[Killed] EqualityOperator
src/DP/StockBuyAndSell.js:8:31
         // Base case: no profit possible if we're past the last day
         dp[n][0] = dp[n][1] = 0;
 
-        for (let ind = n - 1; ind >= 0; ind--) {
+        for (let ind = n - 1; ind > 0; ind--) {
             for (let buy = 0; buy <= 1; buy++) {
                 if (buy === 0) {
killedBy: Test Case 1: Profitable scenario (ascending prices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] BlockStatement
src/DP/StockBuyAndSell.js:8:48
         // Base case: no profit possible if we're past the last day
         dp[n][0] = dp[n][1] = 0;
 
-        for (let ind = n - 1; ind >= 0; ind--) {
-            for (let buy = 0; buy <= 1; buy++) {
-                if (buy === 0) {
-                    dp[ind][buy] = Math.max(0 + dp[ind + 1][0], -prices[ind] + dp[ind + 1][1]);
-                } else {
-                    dp[ind][buy] = Math.max(0 + dp[ind + 1][1], prices[ind] + dp[ind + 1][0]);
-                }
-            }
-        }
+        for (let ind = n - 1; ind >= 0; ind--) {}
 
         return dp[0][0];
killedBy: Test Case 1: Profitable scenario (ascending prices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] ConditionalExpression
src/DP/StockBuyAndSell.js:9:31
         dp[n][0] = dp[n][1] = 0;
 
         for (let ind = n - 1; ind >= 0; ind--) {
-            for (let buy = 0; buy <= 1; buy++) {
+            for (let buy = 0; false; buy++) {
                 if (buy === 0) {
                     dp[ind][buy] = Math.max(0 + dp[ind + 1][0], -prices[ind] + dp[ind + 1][1]);
killedBy: Test Case 1: Profitable scenario (ascending prices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] EqualityOperator
src/DP/StockBuyAndSell.js:9:31
         dp[n][0] = dp[n][1] = 0;
 
         for (let ind = n - 1; ind >= 0; ind--) {
-            for (let buy = 0; buy <= 1; buy++) {
+            for (let buy = 0; buy > 1; buy++) {
                 if (buy === 0) {
                     dp[ind][buy] = Math.max(0 + dp[ind + 1][0], -prices[ind] + dp[ind + 1][1]);
killedBy: Test Case 1: Profitable scenario (ascending prices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] BlockStatement
src/DP/StockBuyAndSell.js:10:32
 
         for (let ind = n - 1; ind >= 0; ind--) {
             for (let buy = 0; buy <= 1; buy++) {
-                if (buy === 0) {
-                    dp[ind][buy] = Math.max(0 + dp[ind + 1][0], -prices[ind] + dp[ind + 1][1]);
-                } else {
+                if (buy === 0) {} else {
                     dp[ind][buy] = Math.max(0 + dp[ind + 1][1], prices[ind] + dp[ind + 1][0]);
                 }
killedBy: Test Case 1: Profitable scenario (ascending prices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] ConditionalExpression
src/DP/StockBuyAndSell.js:10:21
 
         for (let ind = n - 1; ind >= 0; ind--) {
             for (let buy = 0; buy <= 1; buy++) {
-                if (buy === 0) {
+                if (false) {
                     dp[ind][buy] = Math.max(0 + dp[ind + 1][0], -prices[ind] + dp[ind + 1][1]);
                 } else {
killedBy: Test Case 1: Profitable scenario (ascending prices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 15

[Killed] ArithmeticOperator
src/DP/StockBuyAndSell.js:11:52
         for (let ind = n - 1; ind >= 0; ind--) {
             for (let buy = 0; buy <= 1; buy++) {
                 if (buy === 0) {
-                    dp[ind][buy] = Math.max(0 + dp[ind + 1][0], -prices[ind] + dp[ind + 1][1]);
+                    dp[ind][buy] = Math.max(0 + dp[ind - 1][0], -prices[ind] + dp[ind + 1][1]);
                 } else {
                     dp[ind][buy] = Math.max(0 + dp[ind + 1][1], prices[ind] + dp[ind + 1][0]);
killedBy: Test Case 1: Profitable scenario (ascending prices)
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] MethodExpression
src/DP/StockBuyAndSell.js:11:36
         for (let ind = n - 1; ind >= 0; ind--) {
             for (let buy = 0; buy <= 1; buy++) {
                 if (buy === 0) {
-                    dp[ind][buy] = Math.max(0 + dp[ind + 1][0], -prices[ind] + dp[ind + 1][1]);
+                    dp[ind][buy] = Math.min(0 + dp[ind + 1][0], -prices[ind] + dp[ind + 1][1]);
                 } else {
                     dp[ind][buy] = Math.max(0 + dp[ind + 1][1], prices[ind] + dp[ind + 1][0]);
killedBy: Test Case 1: Profitable scenario (ascending prices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: -5

[Killed] BlockStatement
src/DP/StockBuyAndSell.js:12:24
             for (let buy = 0; buy <= 1; buy++) {
                 if (buy === 0) {
                     dp[ind][buy] = Math.max(0 + dp[ind + 1][0], -prices[ind] + dp[ind + 1][1]);
-                } else {
-                    dp[ind][buy] = Math.max(0 + dp[ind + 1][1], prices[ind] + dp[ind + 1][0]);
-                }
+                } else {}
             }
         }
killedBy: Test Case 1: Profitable scenario (ascending prices)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] ArithmeticOperator
src/DP/StockBuyAndSell.js:13:65
                 if (buy === 0) {
                     dp[ind][buy] = Math.max(0 + dp[ind + 1][0], -prices[ind] + dp[ind + 1][1]);
                 } else {
-                    dp[ind][buy] = Math.max(0 + dp[ind + 1][1], prices[ind] + dp[ind + 1][0]);
+                    dp[ind][buy] = Math.max(0 + dp[ind + 1][1], prices[ind] - dp[ind + 1][0]);
                 }
             }
killedBy: Test Case 8: Large price values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8000
Received: 6000

[Killed] ArithmeticOperator
src/DP/StockBuyAndSell.js:13:82
                 if (buy === 0) {
                     dp[ind][buy] = Math.max(0 + dp[ind + 1][0], -prices[ind] + dp[ind + 1][1]);
                 } else {
-                    dp[ind][buy] = Math.max(0 + dp[ind + 1][1], prices[ind] + dp[ind + 1][0]);
+                    dp[ind][buy] = Math.max(0 + dp[ind + 1][1], prices[ind] + dp[ind - 1][0]);
                 }
             }
killedBy: Test Case 1: Profitable scenario (ascending prices)
statusReason: TypeError: Cannot read properties of undefined (reading '0')
