[Killed] BlockStatement
src/DP/TargetSum.js:2:48
 const TargetSum = {
-    findTargetSumWays: function (nums, target) {
-      let sum = 0;
-      for (let num of nums) {
-        sum += num;
-      }
-      if ((target + sum) % 2 !== 0 || (target + sum) < 0) {
-        return 0;
-      }
-      const diff = (target + sum) / 2;
-      const dp = new Array(diff + 1).fill(0);
-      dp[0] = 1;
-      for (let num of nums) {
-        for (let j = diff; j >= num; j--) {
-          dp[j] += dp[j - num];
-        }
-      }
-      return dp[diff];
-    }
+    findTargetSumWays: function (nums, target) {}
   };
   
killedBy: Test Case 1: Example with multiple 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] BlockStatement
src/DP/TargetSum.js:4:29
 const TargetSum = {
     findTargetSumWays: function (nums, target) {
       let sum = 0;
-      for (let num of nums) {
-        sum += num;
-      }
+      for (let num of nums) {}
       if ((target + sum) % 2 !== 0 || (target + sum) < 0) {
         return 0;
killedBy: Test Case 1: Example with multiple 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] AssignmentOperator
src/DP/TargetSum.js:5:9
     findTargetSumWays: function (nums, target) {
       let sum = 0;
       for (let num of nums) {
-        sum += num;
+        sum -= num;
       }
       if ((target + sum) % 2 !== 0 || (target + sum) < 0) {
killedBy: Test Case 1: Example with multiple 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/DP/TargetSum.js:7:39
       for (let num of nums) {
         sum += num;
       }
-      if ((target + sum) % 2 !== 0 || (target + sum) < 0) {
+      if ((target + sum) % 2 !== 0 || false) {
         return 0;
       }
killedBy: Test Case 3: Single large number
statusReason: RangeError: Invalid array length

[Killed] ConditionalExpression
src/DP/TargetSum.js:7:11
       for (let num of nums) {
         sum += num;
       }
-      if ((target + sum) % 2 !== 0 || (target + sum) < 0) {
+      if (true) {
         return 0;
       }
killedBy: Test Case 1: Example with multiple 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ArithmeticOperator
src/DP/TargetSum.js:10:21
       if ((target + sum) % 2 !== 0 || (target + sum) < 0) {
         return 0;
       }
-      const diff = (target + sum) / 2;
+      const diff = (target - sum) / 2;
       const dp = new Array(diff + 1).fill(0);
       dp[0] = 1;
killedBy: Test Case 1: Example with multiple 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
src/DP/TargetSum.js:10:20
       if ((target + sum) % 2 !== 0 || (target + sum) < 0) {
         return 0;
       }
-      const diff = (target + sum) / 2;
+      const diff = (target + sum) * 2;
       const dp = new Array(diff + 1).fill(0);
       dp[0] = 1;
killedBy: Test Case 1: Example with multiple 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ArithmeticOperator
src/DP/TargetSum.js:11:28
         return 0;
       }
       const diff = (target + sum) / 2;
-      const dp = new Array(diff + 1).fill(0);
+      const dp = new Array(diff - 1).fill(0);
       dp[0] = 1;
       for (let num of nums) {
killedBy: Test Case 1: Example with multiple 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: NaN

[Killed] ArrayDeclaration
src/DP/TargetSum.js:11:18
         return 0;
       }
       const diff = (target + sum) / 2;
-      const dp = new Array(diff + 1).fill(0);
+      const dp = new Array().fill(0);
       dp[0] = 1;
       for (let num of nums) {
killedBy: Test Case 1: Example with multiple 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: NaN

[Killed] BlockStatement
src/DP/TargetSum.js:13:29
       const diff = (target + sum) / 2;
       const dp = new Array(diff + 1).fill(0);
       dp[0] = 1;
-      for (let num of nums) {
-        for (let j = diff; j >= num; j--) {
-          dp[j] += dp[j - num];
-        }
-      }
+      for (let num of nums) {}
       return dp[diff];
     }
killedBy: Test Case 1: Example with multiple 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/DP/TargetSum.js:14:43
       const dp = new Array(diff + 1).fill(0);
       dp[0] = 1;
       for (let num of nums) {
-        for (let j = diff; j >= num; j--) {
-          dp[j] += dp[j - num];
-        }
+        for (let j = diff; j >= num; j--) {}
       }
       return dp[diff];
killedBy: Test Case 1: Example with multiple 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/DP/TargetSum.js:14:28
       const dp = new Array(diff + 1).fill(0);
       dp[0] = 1;
       for (let num of nums) {
-        for (let j = diff; j >= num; j--) {
+        for (let j = diff; false; j--) {
           dp[j] += dp[j - num];
         }
killedBy: Test Case 1: Example with multiple 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ArithmeticOperator
src/DP/TargetSum.js:15:23
       dp[0] = 1;
       for (let num of nums) {
         for (let j = diff; j >= num; j--) {
-          dp[j] += dp[j - num];
+          dp[j] += dp[j + num];
         }
       }
killedBy: Test Case 1: Example with multiple 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: NaN

[Killed] AssignmentOperator
src/DP/TargetSum.js:15:11
       dp[0] = 1;
       for (let num of nums) {
         for (let j = diff; j >= num; j--) {
-          dp[j] += dp[j - num];
+          dp[j] -= dp[j - num];
         }
       }
killedBy: Test Case 2: All zeros
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 32
Received: 0
