[Killed] BlockStatement
src/DP/UniquePaths.js:2:32
 class UniquePaths {
-    static uniquePathsDP(m, n) {
-      const dp = new Array(n).fill(1);
-      for (let i = 1; i < m; i++) {
-        for (let j = 1; j < n; j++) {
-          dp[j] += dp[j - 1];
-        }
-      }
-      return dp[n - 1];
-    }
+    static uniquePathsDP(m, n) {}
   }
 module.exports=UniquePaths;  
killedBy: Test Case 1: 1x1 Grid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
src/DP/UniquePaths.js:4:23
 class UniquePaths {
     static uniquePathsDP(m, n) {
       const dp = new Array(n).fill(1);
-      for (let i = 1; i < m; i++) {
+      for (let i = 1; false; i++) {
         for (let j = 1; j < n; j++) {
           dp[j] += dp[j - 1];
killedBy: Test Case 3: 5x100 Grid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4421275
Received: 1

[Killed] EqualityOperator
src/DP/UniquePaths.js:4:23
 class UniquePaths {
     static uniquePathsDP(m, n) {
       const dp = new Array(n).fill(1);
-      for (let i = 1; i < m; i++) {
+      for (let i = 1; i <= m; i++) {
         for (let j = 1; j < n; j++) {
           dp[j] += dp[j - 1];
killedBy: Test Case 2: 1x100 Grid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 100

[Killed] ConditionalExpression
src/DP/UniquePaths.js:5:25
     static uniquePathsDP(m, n) {
       const dp = new Array(n).fill(1);
       for (let i = 1; i < m; i++) {
-        for (let j = 1; j < n; j++) {
+        for (let j = 1; false; j++) {
           dp[j] += dp[j - 1];
         }
killedBy: Test Case 3: 5x100 Grid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4421275
Received: 1

[Killed] BlockStatement
src/DP/UniquePaths.js:5:37
     static uniquePathsDP(m, n) {
       const dp = new Array(n).fill(1);
       for (let i = 1; i < m; i++) {
-        for (let j = 1; j < n; j++) {
-          dp[j] += dp[j - 1];
-        }
+        for (let j = 1; j < n; j++) {}
       }
       return dp[n - 1];
killedBy: Test Case 3: 5x100 Grid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4421275
Received: 1

[Killed] ArithmeticOperator
src/DP/UniquePaths.js:6:23
       const dp = new Array(n).fill(1);
       for (let i = 1; i < m; i++) {
         for (let j = 1; j < n; j++) {
-          dp[j] += dp[j - 1];
+          dp[j] += dp[j + 1];
         }
       }
killedBy: Test Case 3: 5x100 Grid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4421275
Received: NaN

[Killed] AssignmentOperator
src/DP/UniquePaths.js:6:11
       const dp = new Array(n).fill(1);
       for (let i = 1; i < m; i++) {
         for (let j = 1; j < n; j++) {
-          dp[j] += dp[j - 1];
+          dp[j] -= dp[j - 1];
         }
       }
killedBy: Test Case 3: 5x100 Grid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4421275
Received: -87125

[Killed] ArithmeticOperator
src/DP/UniquePaths.js:9:17
           dp[j] += dp[j - 1];
         }
       }
-      return dp[n - 1];
+      return dp[n + 1];
     }
   }
killedBy: Test Case 1: 1x1 Grid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined
