[Killed] BlockStatement
src/DP/coinChange.js:3:38
 class CoinChange {
     // Function to count the number of combinations
-    static coinchange(coins, amount) {
-        const combinations = new Array(amount + 1).fill(0);
-        combinations[0] = 1;
-
-        for (let coin of coins) {
-            for (let i = coin; i <= amount; i++) {
-                combinations[i] += combinations[i - coin];
-            }
-        }
-
-        return combinations[amount];
-    }
+    static coinchange(coins, amount) {}
 
     // Function to find the minimum number of coins
killedBy: CoinChange Tests testMinimumCoinChange1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 91
Received: undefined

[Killed] ArithmeticOperator
src/DP/coinChange.js:4:40
 class CoinChange {
     // Function to count the number of combinations
     static coinchange(coins, amount) {
-        const combinations = new Array(amount + 1).fill(0);
+        const combinations = new Array(amount - 1).fill(0);
         combinations[0] = 1;
 
killedBy: CoinChange Tests testMinimumCoinChange1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 91
Received: NaN

[Killed] BlockStatement
src/DP/coinChange.js:7:33
         const combinations = new Array(amount + 1).fill(0);
         combinations[0] = 1;
 
-        for (let coin of coins) {
-            for (let i = coin; i <= amount; i++) {
-                combinations[i] += combinations[i - coin];
-            }
-        }
+        for (let coin of coins) {}
 
         return combinations[amount];
killedBy: CoinChange Tests testMinimumCoinChange1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 91
Received: 0

[Killed] EqualityOperator
src/DP/coinChange.js:8:32
         combinations[0] = 1;
 
         for (let coin of coins) {
-            for (let i = coin; i <= amount; i++) {
+            for (let i = coin; i < amount; i++) {
                 combinations[i] += combinations[i - coin];
             }
killedBy: CoinChange Tests testMinimumCoinChange1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 91
Received: 0

[Killed] BlockStatement
src/DP/coinChange.js:8:50
         combinations[0] = 1;
 
         for (let coin of coins) {
-            for (let i = coin; i <= amount; i++) {
-                combinations[i] += combinations[i - coin];
-            }
+            for (let i = coin; i <= amount; i++) {}
         }
 
killedBy: CoinChange Tests testMinimumCoinChange1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 91
Received: 0

[Killed] AssignmentOperator
src/DP/coinChange.js:9:17
 
         for (let coin of coins) {
             for (let i = coin; i <= amount; i++) {
-                combinations[i] += combinations[i - coin];
+                combinations[i] -= combinations[i - coin];
             }
         }
killedBy: CoinChange Tests testMinimumCoinChange1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 91
Received: 5

[Killed] ArithmeticOperator
src/DP/coinChange.js:9:49
 
         for (let coin of coins) {
             for (let i = coin; i <= amount; i++) {
-                combinations[i] += combinations[i - coin];
+                combinations[i] += combinations[i + coin];
             }
         }
killedBy: CoinChange Tests testMinimumCoinChange1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 91
Received: NaN

[Killed] BlockStatement
src/DP/coinChange.js:17:40
     }
 
     // Function to find the minimum number of coins
-    static minimumCoins(coins, amount) {
-        const minimumCoins = new Array(amount + 1).fill(Infinity);
-        minimumCoins[0] = 0;
-
-        for (let i = 1; i <= amount; i++) {
-            for (let coin of coins) {
-                if (coin <= i) {
-                    const sub_res = minimumCoins[i - coin];
-                    if (sub_res !== Infinity && sub_res + 1 < minimumCoins[i]) {
-                        minimumCoins[i] = sub_res + 1;
-                    }
-                }
-            }
-        }
-
-        return minimumCoins[amount] === Infinity ? -1 : minimumCoins[amount];
-    }
+    static minimumCoins(coins, amount) {}
 }
 module.exports=CoinChange;
killedBy: CoinChange Tests testMinimumCoinChange4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
src/DP/coinChange.js:18:40
 
     // Function to find the minimum number of coins
     static minimumCoins(coins, amount) {
-        const minimumCoins = new Array(amount + 1).fill(Infinity);
+        const minimumCoins = new Array(amount - 1).fill(Infinity);
         minimumCoins[0] = 0;
 
killedBy: CoinChange Tests testMinimumCoinChange4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArrayDeclaration
src/DP/coinChange.js:18:30
 
     // Function to find the minimum number of coins
     static minimumCoins(coins, amount) {
-        const minimumCoins = new Array(amount + 1).fill(Infinity);
+        const minimumCoins = new Array().fill(Infinity);
         minimumCoins[0] = 0;
 
killedBy: CoinChange Tests testMinimumCoinChange4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] BlockStatement
src/DP/coinChange.js:21:43
         const minimumCoins = new Array(amount + 1).fill(Infinity);
         minimumCoins[0] = 0;
 
-        for (let i = 1; i <= amount; i++) {
-            for (let coin of coins) {
-                if (coin <= i) {
-                    const sub_res = minimumCoins[i - coin];
-                    if (sub_res !== Infinity && sub_res + 1 < minimumCoins[i]) {
-                        minimumCoins[i] = sub_res + 1;
-                    }
-                }
-            }
-        }
+        for (let i = 1; i <= amount; i++) {}
 
         return minimumCoins[amount] === Infinity ? -1 : minimumCoins[amount];
killedBy: CoinChange Tests testMinimumCoinChange4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ConditionalExpression
src/DP/coinChange.js:21:25
         const minimumCoins = new Array(amount + 1).fill(Infinity);
         minimumCoins[0] = 0;
 
-        for (let i = 1; i <= amount; i++) {
+        for (let i = 1; false; i++) {
             for (let coin of coins) {
                 if (coin <= i) {
killedBy: CoinChange Tests testMinimumCoinChange4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] BlockStatement
src/DP/coinChange.js:22:37
         minimumCoins[0] = 0;
 
         for (let i = 1; i <= amount; i++) {
-            for (let coin of coins) {
-                if (coin <= i) {
-                    const sub_res = minimumCoins[i - coin];
-                    if (sub_res !== Infinity && sub_res + 1 < minimumCoins[i]) {
-                        minimumCoins[i] = sub_res + 1;
-                    }
-                }
-            }
+            for (let coin of coins) {}
         }
 
killedBy: CoinChange Tests testMinimumCoinChange4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] BlockStatement
src/DP/coinChange.js:23:32
 
         for (let i = 1; i <= amount; i++) {
             for (let coin of coins) {
-                if (coin <= i) {
-                    const sub_res = minimumCoins[i - coin];
-                    if (sub_res !== Infinity && sub_res + 1 < minimumCoins[i]) {
-                        minimumCoins[i] = sub_res + 1;
-                    }
-                }
+                if (coin <= i) {}
             }
         }
killedBy: CoinChange Tests testMinimumCoinChange4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ConditionalExpression
src/DP/coinChange.js:23:21
 
         for (let i = 1; i <= amount; i++) {
             for (let coin of coins) {
-                if (coin <= i) {
+                if (false) {
                     const sub_res = minimumCoins[i - coin];
                     if (sub_res !== Infinity && sub_res + 1 < minimumCoins[i]) {
killedBy: CoinChange Tests testMinimumCoinChange4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ArithmeticOperator
src/DP/coinChange.js:24:50
         for (let i = 1; i <= amount; i++) {
             for (let coin of coins) {
                 if (coin <= i) {
-                    const sub_res = minimumCoins[i - coin];
+                    const sub_res = minimumCoins[i + coin];
                     if (sub_res !== Infinity && sub_res + 1 < minimumCoins[i]) {
                         minimumCoins[i] = sub_res + 1;
killedBy: CoinChange Tests testMinimumCoinChange4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] EqualityOperator
src/DP/coinChange.js:25:49
             for (let coin of coins) {
                 if (coin <= i) {
                     const sub_res = minimumCoins[i - coin];
-                    if (sub_res !== Infinity && sub_res + 1 < minimumCoins[i]) {
+                    if (sub_res !== Infinity && sub_res + 1 >= minimumCoins[i]) {
                         minimumCoins[i] = sub_res + 1;
                     }
killedBy: CoinChange Tests testMinimumCoinChange4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ConditionalExpression
src/DP/coinChange.js:25:25
             for (let coin of coins) {
                 if (coin <= i) {
                     const sub_res = minimumCoins[i - coin];
-                    if (sub_res !== Infinity && sub_res + 1 < minimumCoins[i]) {
+                    if (false) {
                         minimumCoins[i] = sub_res + 1;
                     }
killedBy: CoinChange Tests testMinimumCoinChange4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ArithmeticOperator
src/DP/coinChange.js:26:43
                 if (coin <= i) {
                     const sub_res = minimumCoins[i - coin];
                     if (sub_res !== Infinity && sub_res + 1 < minimumCoins[i]) {
-                        minimumCoins[i] = sub_res + 1;
+                        minimumCoins[i] = sub_res - 1;
                     }
                 }
killedBy: CoinChange Tests testMinimumCoinChange4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -7

[Killed] ConditionalExpression
src/DP/coinChange.js:32:16
             }
         }
 
-        return minimumCoins[amount] === Infinity ? -1 : minimumCoins[amount];
+        return true ? -1 : minimumCoins[amount];
     }
 }
killedBy: CoinChange Tests testMinimumCoinChange4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] EqualityOperator
src/DP/coinChange.js:32:16
             }
         }
 
-        return minimumCoins[amount] === Infinity ? -1 : minimumCoins[amount];
+        return minimumCoins[amount] !== Infinity ? -1 : minimumCoins[amount];
     }
 }
killedBy: CoinChange Tests testMinimumCoinChange4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1
