[Killed] BlockStatement
src/DP/knapsack.js:2:29
 class Knapsack {
-    knapSack(W, wt, val, n) {
-        if (!wt || !val) {
-            throw new Error("Invalid input: weights or values cannot be null.");
-        }
-
-        const dp = Array.from({ length: n + 1 }, () => Array(W + 1).fill(0));
-
-        for (let i = 0; i <= n; i++) {
-            for (let w = 0; w <= W; w++) {
-                if (i === 0 || w === 0) {
-                    dp[i][w] = 0;
-                } else if (wt[i - 1] <= w) {
-                    dp[i][w] = Math.max(
-                        val[i - 1] + dp[i - 1][w - wt[i - 1]],
-                        dp[i - 1][w]
-                    );
-                } else {
-                    dp[i][w] = dp[i - 1][w];
-                }
-            }
-        }
-
-        return dp[n][W];
-    }
+    knapSack(W, wt, val, n) {}
 }
 module.exports=Knapsack;
killedBy: Knapsack Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: undefined

[Killed] BooleanLiteral
src/DP/knapsack.js:3:20
 class Knapsack {
     knapSack(W, wt, val, n) {
-        if (!wt || !val) {
+        if (!wt || val) {
             throw new Error("Invalid input: weights or values cannot be null.");
         }
killedBy: Knapsack Test 1
statusReason: Error: Invalid input: weights or values cannot be null.

[Killed] BooleanLiteral
src/DP/knapsack.js:3:13
 class Knapsack {
     knapSack(W, wt, val, n) {
-        if (!wt || !val) {
+        if (wt || !val) {
             throw new Error("Invalid input: weights or values cannot be null.");
         }
killedBy: Knapsack Test 1
statusReason: Error: Invalid input: weights or values cannot be null.

[Killed] ArithmeticOperator
src/DP/knapsack.js:7:41
             throw new Error("Invalid input: weights or values cannot be null.");
         }
 
-        const dp = Array.from({ length: n + 1 }, () => Array(W + 1).fill(0));
+        const dp = Array.from({ length: n - 1 }, () => Array(W + 1).fill(0));
 
         for (let i = 0; i <= n; i++) {
killedBy: Knapsack Test 1
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Killed] ArithmeticOperator
src/DP/knapsack.js:7:62
             throw new Error("Invalid input: weights or values cannot be null.");
         }
 
-        const dp = Array.from({ length: n + 1 }, () => Array(W + 1).fill(0));
+        const dp = Array.from({ length: n + 1 }, () => Array(W - 1).fill(0));
 
         for (let i = 0; i <= n; i++) {
killedBy: Knapsack Test - Zero capacity
statusReason: RangeError: Invalid array length

[Killed] EqualityOperator
src/DP/knapsack.js:9:25
 
         const dp = Array.from({ length: n + 1 }, () => Array(W + 1).fill(0));
 
-        for (let i = 0; i <= n; i++) {
+        for (let i = 0; i > n; i++) {
             for (let w = 0; w <= W; w++) {
                 if (i === 0 || w === 0) {
killedBy: Knapsack Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 0

[Killed] UpdateOperator
src/DP/knapsack.js:9:33
 
         const dp = Array.from({ length: n + 1 }, () => Array(W + 1).fill(0));
 
-        for (let i = 0; i <= n; i++) {
+        for (let i = 0; i <= n; i--) {
             for (let w = 0; w <= W; w++) {
                 if (i === 0 || w === 0) {
killedBy: Knapsack Test 1
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Killed] BlockStatement
src/DP/knapsack.js:10:42
         const dp = Array.from({ length: n + 1 }, () => Array(W + 1).fill(0));
 
         for (let i = 0; i <= n; i++) {
-            for (let w = 0; w <= W; w++) {
-                if (i === 0 || w === 0) {
-                    dp[i][w] = 0;
-                } else if (wt[i - 1] <= w) {
-                    dp[i][w] = Math.max(
-                        val[i - 1] + dp[i - 1][w - wt[i - 1]],
-                        dp[i - 1][w]
-                    );
-                } else {
-                    dp[i][w] = dp[i - 1][w];
-                }
-            }
+            for (let w = 0; w <= W; w++) {}
         }
 
killedBy: Knapsack Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 0

[Killed] EqualityOperator
src/DP/knapsack.js:10:29
         const dp = Array.from({ length: n + 1 }, () => Array(W + 1).fill(0));
 
         for (let i = 0; i <= n; i++) {
-            for (let w = 0; w <= W; w++) {
+            for (let w = 0; w > W; w++) {
                 if (i === 0 || w === 0) {
                     dp[i][w] = 0;
killedBy: Knapsack Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 0

[Killed] ConditionalExpression
src/DP/knapsack.js:11:21
 
         for (let i = 0; i <= n; i++) {
             for (let w = 0; w <= W; w++) {
-                if (i === 0 || w === 0) {
+                if (true) {
                     dp[i][w] = 0;
                 } else if (wt[i - 1] <= w) {
killedBy: Knapsack Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 0

[Killed] EqualityOperator
src/DP/knapsack.js:11:32
 
         for (let i = 0; i <= n; i++) {
             for (let w = 0; w <= W; w++) {
-                if (i === 0 || w === 0) {
+                if (i === 0 || w !== 0) {
                     dp[i][w] = 0;
                 } else if (wt[i - 1] <= w) {
killedBy: Knapsack Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 0

[Killed] EqualityOperator
src/DP/knapsack.js:13:28
             for (let w = 0; w <= W; w++) {
                 if (i === 0 || w === 0) {
                     dp[i][w] = 0;
-                } else if (wt[i - 1] <= w) {
+                } else if (wt[i - 1] > w) {
                     dp[i][w] = Math.max(
                         val[i - 1] + dp[i - 1][w - wt[i - 1]],
killedBy: Knapsack Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: NaN

[Killed] BlockStatement
src/DP/knapsack.js:13:44
             for (let w = 0; w <= W; w++) {
                 if (i === 0 || w === 0) {
                     dp[i][w] = 0;
-                } else if (wt[i - 1] <= w) {
-                    dp[i][w] = Math.max(
-                        val[i - 1] + dp[i - 1][w - wt[i - 1]],
-                        dp[i - 1][w]
-                    );
-                } else {
+                } else if (wt[i - 1] <= w) {} else {
                     dp[i][w] = dp[i - 1][w];
                 }
killedBy: Knapsack Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 0

[Killed] MethodExpression
src/DP/knapsack.js:14:32
                 if (i === 0 || w === 0) {
                     dp[i][w] = 0;
                 } else if (wt[i - 1] <= w) {
-                    dp[i][w] = Math.max(
-                        val[i - 1] + dp[i - 1][w - wt[i - 1]],
-                        dp[i - 1][w]
-                    );
+                    dp[i][w] = Math.min(val[i - 1] + dp[i - 1][w - wt[i - 1]], dp[i - 1][w]);
                 } else {
                     dp[i][w] = dp[i - 1][w];
killedBy: Knapsack Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 0

[Killed] ArithmeticOperator
src/DP/knapsack.js:15:55
                     dp[i][w] = 0;
                 } else if (wt[i - 1] <= w) {
                     dp[i][w] = Math.max(
-                        val[i - 1] + dp[i - 1][w - wt[i - 1]],
+                        val[i - 1] + dp[i - 1][w - wt[i + 1]],
                         dp[i - 1][w]
                     );
killedBy: Knapsack Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: NaN

[Killed] ArithmeticOperator
src/DP/knapsack.js:15:48
                     dp[i][w] = 0;
                 } else if (wt[i - 1] <= w) {
                     dp[i][w] = Math.max(
-                        val[i - 1] + dp[i - 1][w - wt[i - 1]],
+                        val[i - 1] + dp[i - 1][w + wt[i - 1]],
                         dp[i - 1][w]
                     );
killedBy: Knapsack Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: NaN

[Killed] ArithmeticOperator
src/DP/knapsack.js:16:28
                 } else if (wt[i - 1] <= w) {
                     dp[i][w] = Math.max(
                         val[i - 1] + dp[i - 1][w - wt[i - 1]],
-                        dp[i - 1][w]
+                        dp[i + 1][w]
                     );
                 } else {
killedBy: Knapsack Test 4
statusReason: TypeError: Cannot read properties of undefined (reading '5')

[Killed] BlockStatement
src/DP/knapsack.js:18:24
                         val[i - 1] + dp[i - 1][w - wt[i - 1]],
                         dp[i - 1][w]
                     );
-                } else {
-                    dp[i][w] = dp[i - 1][w];
-                }
+                } else {}
             }
         }
killedBy: Knapsack Test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 0

[Killed] ArithmeticOperator
src/DP/knapsack.js:19:35
                         dp[i - 1][w]
                     );
                 } else {
-                    dp[i][w] = dp[i - 1][w];
+                    dp[i][w] = dp[i + 1][w];
                 }
             }
killedBy: Knapsack Test 1
statusReason: TypeError: Cannot read properties of undefined (reading '1')
