[Killed] BlockStatement
src/Searching/BinarySearch.js:3:34
 class BinarySearch{
 
-static binarySearch(arr, target) {
-    let left = 0;
-    let right = arr.length - 1;
-  
-    while (left <= right) {
-      const mid = left + Math.floor((right - left) / 2);
-  
-      if (arr[mid] === target) {
-        return mid;
-      }
-  
-      if (arr[mid] < target) {
-        left = mid + 1;
-      } else {
-        right = mid - 1;
-      }
-    }
-    return -1;
-  }
+static binarySearch(arr, target) {}
 }
 module.exports=BinarySearch; 
killedBy: Test 1: Target is in the middle of the array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
src/Searching/BinarySearch.js:8:19
     let right = arr.length - 1;
   
     while (left <= right) {
-      const mid = left + Math.floor((right - left) / 2);
+      const mid = left - Math.floor((right - left) / 2);
   
       if (arr[mid] === target) {
killedBy: Test 1: Target is in the middle of the array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Timeout] ArithmeticOperator
src/Searching/BinarySearch.js:8:37
     let right = arr.length - 1;
   
     while (left <= right) {
-      const mid = left + Math.floor((right - left) / 2);
+      const mid = left + Math.floor((right - left) * 2);
   
       if (arr[mid] === target) {

[Killed] BlockStatement
src/Searching/BinarySearch.js:10:32
     while (left <= right) {
       const mid = left + Math.floor((right - left) / 2);
   
-      if (arr[mid] === target) {
-        return mid;
-      }
+      if (arr[mid] === target) {}
   
       if (arr[mid] < target) {
killedBy: Test 1: Target is in the middle of the array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ConditionalExpression
src/Searching/BinarySearch.js:10:11
     while (left <= right) {
       const mid = left + Math.floor((right - left) / 2);
   
-      if (arr[mid] === target) {
+      if (true) {
         return mid;
       }
killedBy: Test 2: Target is the first element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] ConditionalExpression
src/Searching/BinarySearch.js:14:11
         return mid;
       }
   
-      if (arr[mid] < target) {
+      if (false) {
         left = mid + 1;
       } else {
killedBy: Test 3: Target is the last element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: -1

[Killed] ConditionalExpression
src/Searching/BinarySearch.js:14:11
         return mid;
       }
   
-      if (arr[mid] < target) {
+      if (true) {
         left = mid + 1;
       } else {
killedBy: Test 2: Target is the first element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1

[Timeout] ArithmeticOperator
src/Searching/BinarySearch.js:15:16
       }
   
       if (arr[mid] < target) {
-        left = mid + 1;
+        left = mid - 1;
       } else {
         right = mid - 1;
