[Killed] BlockStatement
src/Searching/ExponentialSearch.js:2:43
 class ExponentialSearch {
-    static exponentialSearch(arr, target) {
-        const n = arr.length;
-
-        // If the target is at the first position
-        if (n === 0) return -1;
-        if (arr[0] === target) return 0;
-
-        // Find the range where the target might exist
-        let bound = 1;
-        while (bound < n && arr[bound] <= target) {
-            bound *= 2;
-        }
-
-        // Perform binary search in the found range
-        return this.binarySearch(arr, target, bound / 2, Math.min(bound, n - 1));
-    }
+    static exponentialSearch(arr, target) {}
 
     static binarySearch(arr, target, left, right) {
killedBy: ExponentialSearchTargetInRightSubarray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] EqualityOperator
src/Searching/ExponentialSearch.js:6:13
         const n = arr.length;
 
         // If the target is at the first position
-        if (n === 0) return -1;
+        if (n !== 0) return -1;
         if (arr[0] === target) return 0;
 
killedBy: ExponentialSearchTargetInRightSubarray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: -1

[Killed] ConditionalExpression
src/Searching/ExponentialSearch.js:6:13
         const n = arr.length;
 
         // If the target is at the first position
-        if (n === 0) return -1;
+        if (true) return -1;
         if (arr[0] === target) return 0;
 
killedBy: ExponentialSearchTargetInRightSubarray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: -1

[Killed] ConditionalExpression
src/Searching/ExponentialSearch.js:7:13
 
         // If the target is at the first position
         if (n === 0) return -1;
-        if (arr[0] === target) return 0;
+        if (false) return 0;
 
         // Find the range where the target might exist
killedBy: ExponentialSearch1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1

[Killed] EqualityOperator
src/Searching/ExponentialSearch.js:7:13
 
         // If the target is at the first position
         if (n === 0) return -1;
-        if (arr[0] === target) return 0;
+        if (arr[0] !== target) return 0;
 
         // Find the range where the target might exist
killedBy: ExponentialSearchTargetInRightSubarray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Killed] ConditionalExpression
src/Searching/ExponentialSearch.js:11:29
 
         // Find the range where the target might exist
         let bound = 1;
-        while (bound < n && arr[bound] <= target) {
+        while (bound < n && true) {
             bound *= 2;
         }
killedBy: ExponentialSearchTargetInLeftSubarray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] ConditionalExpression
src/Searching/ExponentialSearch.js:11:16
 
         // Find the range where the target might exist
         let bound = 1;
-        while (bound < n && arr[bound] <= target) {
+        while (false) {
             bound *= 2;
         }
killedBy: ExponentialSearchTargetInRightSubarray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: -1

[Killed] AssignmentOperator
src/Searching/ExponentialSearch.js:12:13
         // Find the range where the target might exist
         let bound = 1;
         while (bound < n && arr[bound] <= target) {
-            bound *= 2;
+            bound /= 2;
         }
 
killedBy: ExponentialSearchTargetInRightSubarray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: -1

[Killed] ArithmeticOperator
src/Searching/ExponentialSearch.js:16:47
         }
 
         // Perform binary search in the found range
-        return this.binarySearch(arr, target, bound / 2, Math.min(bound, n - 1));
+        return this.binarySearch(arr, target, bound * 2, Math.min(bound, n - 1));
     }
 
killedBy: ExponentialSearchTargetInRightSubarray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: -1

[Survived] MethodExpression
src/Searching/ExponentialSearch.js:16:58
         }
 
         // Perform binary search in the found range
-        return this.binarySearch(arr, target, bound / 2, Math.min(bound, n - 1));
+        return this.binarySearch(arr, target, bound / 2, Math.max(bound, n - 1));
     }
 

[Killed] BlockStatement
src/Searching/ExponentialSearch.js:19:51
         return this.binarySearch(arr, target, bound / 2, Math.min(bound, n - 1));
     }
 
-    static binarySearch(arr, target, left, right) {
-        while (left <= right) {
-            const mid = left + Math.floor((right - left) / 2);
-
-            // Check if the target is at mid
-            if (arr[mid] === target) {
-                return mid;
-            }
-
-            // Adjust the search range
-            if (arr[mid] < target) {
-                left = mid + 1;
-            } else {
-                right = mid - 1;
-            }
-        }
-        return -1; // Target not found
-    }
+    static binarySearch(arr, target, left, right) {}
 }
 
killedBy: ExponentialSearchTargetInRightSubarray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] EqualityOperator
src/Searching/ExponentialSearch.js:20:16
     }
 
     static binarySearch(arr, target, left, right) {
-        while (left <= right) {
+        while (left > right) {
             const mid = left + Math.floor((right - left) / 2);
 
killedBy: ExponentialSearchTargetInRightSubarray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: -1

[Killed] EqualityOperator
src/Searching/ExponentialSearch.js:20:16
     }
 
     static binarySearch(arr, target, left, right) {
-        while (left <= right) {
+        while (left < right) {
             const mid = left + Math.floor((right - left) / 2);
 
killedBy: ExponentialSearchTargetAtBound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: -1

[Killed] BlockStatement
src/Searching/ExponentialSearch.js:24:38
             const mid = left + Math.floor((right - left) / 2);
 
             // Check if the target is at mid
-            if (arr[mid] === target) {
-                return mid;
-            }
+            if (arr[mid] === target) {}
 
             // Adjust the search range
killedBy: ExponentialSearchTargetInRightSubarray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: -1

[Killed] EqualityOperator
src/Searching/ExponentialSearch.js:24:17
             const mid = left + Math.floor((right - left) / 2);
 
             // Check if the target is at mid
-            if (arr[mid] === target) {
+            if (arr[mid] !== target) {
                 return mid;
             }
killedBy: ExponentialSearchTargetInRightSubarray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Killed] ConditionalExpression
src/Searching/ExponentialSearch.js:29:17
             }
 
             // Adjust the search range
-            if (arr[mid] < target) {
+            if (false) {
                 left = mid + 1;
             } else {
killedBy: ExponentialSearchTargetInRightSubarray
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: -1

[Killed] ConditionalExpression
src/Searching/ExponentialSearch.js:29:17
             }
 
             // Adjust the search range
-            if (arr[mid] < target) {
+            if (true) {
                 left = mid + 1;
             } else {
killedBy: ExponentialSearchTargetAtBound
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: -1

[Killed] UnaryOperator
src/Searching/ExponentialSearch.js:35:16
                 right = mid - 1;
             }
         }
-        return -1; // Target not found
+        return +1; // Target not found
     }
 }
killedBy: ExponentialSearchTargetLargerThanAll
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 1
