[Killed] BlockStatement
src/Searching/JumpSearch.js:2:36
 class JumpSearch {
-    static jumpSearch(arr, target) {
-        const n = arr.length;
-
-        // Determine the optimal jump size
-        let step = Math.floor(Math.sqrt(n));
-
-        // Find the block where the element might be present
-        let prev = 0;
-        while (prev < n && arr[Math.min(step, n) - 1] < target) {
-            prev = step;
-            step += Math.floor(Math.sqrt(n));
-
-            // If we go beyond the array size
-            if (prev >= n) {
-                return -1;
-            }
-        }
-
-        // Perform linear search in the identified block
-        return this.linearSearch(arr, target, prev, Math.min(step, n));
-    }
+    static jumpSearch(arr, target) {}
 
     static linearSearch(arr, target, start, end) {
killedBy: Target is at the beginning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] EqualityOperator
src/Searching/JumpSearch.js:10:28
 
         // Find the block where the element might be present
         let prev = 0;
-        while (prev < n && arr[Math.min(step, n) - 1] < target) {
+        while (prev < n && arr[Math.min(step, n) - 1] <= target) {
             prev = step;
             step += Math.floor(Math.sqrt(n));
killedBy: Target is at the end
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: -1

[Killed] MethodExpression
src/Searching/JumpSearch.js:10:32
 
         // Find the block where the element might be present
         let prev = 0;
-        while (prev < n && arr[Math.min(step, n) - 1] < target) {
+        while (prev < n && arr[Math.max(step, n) - 1] < target) {
             prev = step;
             step += Math.floor(Math.sqrt(n));
killedBy: Target is at the end
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: -1

[Killed] AssignmentOperator
src/Searching/JumpSearch.js:12:13
         let prev = 0;
         while (prev < n && arr[Math.min(step, n) - 1] < target) {
             prev = step;
-            step += Math.floor(Math.sqrt(n));
+            step -= Math.floor(Math.sqrt(n));
 
             // If we go beyond the array size
killedBy: Target is at the end
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: -1

[Killed] EqualityOperator
src/Searching/JumpSearch.js:15:17
             step += Math.floor(Math.sqrt(n));
 
             // If we go beyond the array size
-            if (prev >= n) {
+            if (prev < n) {
                 return -1;
             }
killedBy: Target is at the end
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: -1

[Killed] ConditionalExpression
src/Searching/JumpSearch.js:15:17
             step += Math.floor(Math.sqrt(n));
 
             // If we go beyond the array size
-            if (prev >= n) {
+            if (true) {
                 return -1;
             }
killedBy: Target is at the end
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: -1

[Killed] UnaryOperator
src/Searching/JumpSearch.js:16:24
 
             // If we go beyond the array size
             if (prev >= n) {
-                return -1;
+                return +1;
             }
         }
killedBy: Repeated values but no match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 1

[Survived] MethodExpression
src/Searching/JumpSearch.js:21:53
         }
 
         // Perform linear search in the identified block
-        return this.linearSearch(arr, target, prev, Math.min(step, n));
+        return this.linearSearch(arr, target, prev, Math.max(step, n));
     }
 

[Killed] BlockStatement
src/Searching/JumpSearch.js:24:50
         return this.linearSearch(arr, target, prev, Math.min(step, n));
     }
 
-    static linearSearch(arr, target, start, end) {
-        for (let i = start; i < end; i++) {
-            if (arr[i] === target) {
-                return i;
-            }
-        }
-        return -1;
-    }
+    static linearSearch(arr, target, start, end) {}
 }
 
killedBy: Target is at the beginning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
src/Searching/JumpSearch.js:25:29
     }
 
     static linearSearch(arr, target, start, end) {
-        for (let i = start; i < end; i++) {
+        for (let i = start; false; i++) {
             if (arr[i] === target) {
                 return i;
killedBy: Target is at the beginning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1

[Killed] BlockStatement
src/Searching/JumpSearch.js:25:43
     }
 
     static linearSearch(arr, target, start, end) {
-        for (let i = start; i < end; i++) {
-            if (arr[i] === target) {
-                return i;
-            }
-        }
+        for (let i = start; i < end; i++) {}
         return -1;
     }
killedBy: Target is at the beginning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1

[Killed] ConditionalExpression
src/Searching/JumpSearch.js:26:17
 
     static linearSearch(arr, target, start, end) {
         for (let i = start; i < end; i++) {
-            if (arr[i] === target) {
+            if (true) {
                 return i;
             }
killedBy: Target is in the middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Killed] EqualityOperator
src/Searching/JumpSearch.js:26:17
 
     static linearSearch(arr, target, start, end) {
         for (let i = start; i < end; i++) {
-            if (arr[i] === target) {
+            if (arr[i] !== target) {
                 return i;
             }
killedBy: Target is at the beginning
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1
