[Killed] BlockStatement
src/Searching/LinearSearch.js:2:38
 class LinearSearch {
-    static linearSearch(arr, target) {
-        for (let i = 0; i < arr.length; i++) {
-            if (arr[i] === target) {
-                return i;
-            }
-        }
-        return -1;
-    }
+    static linearSearch(arr, target) {}
 }
 
killedBy: Test Case 1: Target is in the middle of the array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ConditionalExpression
src/Searching/LinearSearch.js:3:25
 class LinearSearch {
     static linearSearch(arr, target) {
-        for (let i = 0; i < arr.length; i++) {
+        for (let i = 0; false; i++) {
             if (arr[i] === target) {
                 return i;
killedBy: Test Case 1: Target is in the middle of the array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] BlockStatement
src/Searching/LinearSearch.js:3:46
 class LinearSearch {
     static linearSearch(arr, target) {
-        for (let i = 0; i < arr.length; i++) {
-            if (arr[i] === target) {
-                return i;
-            }
-        }
+        for (let i = 0; i < arr.length; i++) {}
         return -1;
     }
killedBy: Test Case 1: Target is in the middle of the array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] EqualityOperator
src/Searching/LinearSearch.js:4:17
 class LinearSearch {
     static linearSearch(arr, target) {
         for (let i = 0; i < arr.length; i++) {
-            if (arr[i] === target) {
+            if (arr[i] !== target) {
                 return i;
             }
killedBy: Test Case 1: Target is in the middle of the array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
src/Searching/LinearSearch.js:4:36
 class LinearSearch {
     static linearSearch(arr, target) {
         for (let i = 0; i < arr.length; i++) {
-            if (arr[i] === target) {
-                return i;
-            }
+            if (arr[i] === target) {}
         }
         return -1;
killedBy: Test Case 1: Target is in the middle of the array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1
