[Killed] BlockStatement
src/Sorting/BubbleSort.js:2:28
 class BubbleSort {
-    static bubbleSort(arr) {
-        const n = arr.length;
-        for (let i = 0; i < n - 1; i++) {
-            for (let j = 0; j < n - 1 - i; j++) {
-                if (arr[j] > arr[j + 1]) {
-                    // Swap the elements
-                    let temp = arr[j];
-                    arr[j] = arr[j + 1];
-                    arr[j + 1] = temp;
-                }
-            }
-        }
-    }
+    static bubbleSort(arr) {}
 }
 module.exports=BubbleSort;
killedBy: testBubbleSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   11,
+   64,

[Killed] BlockStatement
src/Sorting/BubbleSort.js:4:41
 class BubbleSort {
     static bubbleSort(arr) {
         const n = arr.length;
-        for (let i = 0; i < n - 1; i++) {
-            for (let j = 0; j < n - 1 - i; j++) {
-                if (arr[j] > arr[j + 1]) {
-                    // Swap the elements
-                    let temp = arr[j];
-                    arr[j] = arr[j + 1];
-                    arr[j + 1] = temp;
-                }
-            }
-        }
+        for (let i = 0; i < n - 1; i++) {}
     }
 }
killedBy: testBubbleSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   11,
+   64,

[Killed] ConditionalExpression
src/Sorting/BubbleSort.js:5:29
     static bubbleSort(arr) {
         const n = arr.length;
         for (let i = 0; i < n - 1; i++) {
-            for (let j = 0; j < n - 1 - i; j++) {
+            for (let j = 0; false; j++) {
                 if (arr[j] > arr[j + 1]) {
                     // Swap the elements
killedBy: testBubbleSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   11,
+   64,

[Killed] EqualityOperator
src/Sorting/BubbleSort.js:5:29
     static bubbleSort(arr) {
         const n = arr.length;
         for (let i = 0; i < n - 1; i++) {
-            for (let j = 0; j < n - 1 - i; j++) {
+            for (let j = 0; j >= n - 1 - i; j++) {
                 if (arr[j] > arr[j + 1]) {
                     // Swap the elements
killedBy: testBubbleSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   11,
+   64,

[Killed] BlockStatement
src/Sorting/BubbleSort.js:6:42
         const n = arr.length;
         for (let i = 0; i < n - 1; i++) {
             for (let j = 0; j < n - 1 - i; j++) {
-                if (arr[j] > arr[j + 1]) {
-                    // Swap the elements
-                    let temp = arr[j];
-                    arr[j] = arr[j + 1];
-                    arr[j + 1] = temp;
-                }
+                if (arr[j] > arr[j + 1]) {}
             }
         }
killedBy: testBubbleSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   11,
+   64,

[Killed] EqualityOperator
src/Sorting/BubbleSort.js:6:21
         const n = arr.length;
         for (let i = 0; i < n - 1; i++) {
             for (let j = 0; j < n - 1 - i; j++) {
-                if (arr[j] > arr[j + 1]) {
+                if (arr[j] <= arr[j + 1]) {
                     // Swap the elements
                     let temp = arr[j];
killedBy: testBubbleSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
-   11,
-   12,

[Killed] ArithmeticOperator
src/Sorting/BubbleSort.js:9:34
                 if (arr[j] > arr[j + 1]) {
                     // Swap the elements
                     let temp = arr[j];
-                    arr[j] = arr[j + 1];
+                    arr[j] = arr[j - 1];
                     arr[j + 1] = temp;
                 }
killedBy: testBubbleSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   11,
-   12,

[Killed] ArithmeticOperator
src/Sorting/BubbleSort.js:10:25
                     // Swap the elements
                     let temp = arr[j];
                     arr[j] = arr[j + 1];
-                    arr[j + 1] = temp;
+                    arr[j - 1] = temp;
                 }
             }
killedBy: testBubbleSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
    11,
-   12,
