[Killed] EqualityOperator
src/Sorting/CountingSort.js:3:13
 class CountingSort {
     static countingSort(arr) {
-        if (arr.length === 0) return arr;
+        if (arr.length !== 0) return arr;
 
         const max = Math.max(...arr);
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
+   4,

[Killed] ConditionalExpression
src/Sorting/CountingSort.js:3:13
 class CountingSort {
     static countingSort(arr) {
-        if (arr.length === 0) return arr;
+        if (true) return arr;
 
         const max = Math.max(...arr);
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
+   4,

[Killed] MethodExpression
src/Sorting/CountingSort.js:5:21
     static countingSort(arr) {
         if (arr.length === 0) return arr;
 
-        const max = Math.max(...arr);
+        const max = Math.min(...arr);
         const min = Math.min(...arr);
         const range = max - min + 1;
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    1,
    2,

[Killed] MethodExpression
src/Sorting/CountingSort.js:6:21
         if (arr.length === 0) return arr;
 
         const max = Math.max(...arr);
-        const min = Math.min(...arr);
+        const min = Math.max(...arr);
         const range = max - min + 1;
 
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
+   8,

[Killed] ArithmeticOperator
src/Sorting/CountingSort.js:7:23
 
         const max = Math.max(...arr);
         const min = Math.min(...arr);
-        const range = max - min + 1;
+        const range = max - min - 1;
 
         // Create and initialize the counting array
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -3,7 +3,7 @@
    2,
    2,

[Survived] ArithmeticOperator
src/Sorting/CountingSort.js:7:23
 
         const max = Math.max(...arr);
         const min = Math.min(...arr);
-        const range = max - min + 1;
+        const range = max + min + 1;
 
         // Create and initialize the counting array

[Killed] ArrayDeclaration
src/Sorting/CountingSort.js:10:23
         const range = max - min + 1;
 
         // Create and initialize the counting array
-        const count = Array(range).fill(0);
+        const count = Array().fill(0);
 
         // Store the count of each number
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
+   4,

[Killed] EqualityOperator
src/Sorting/CountingSort.js:13:25
         const count = Array(range).fill(0);
 
         // Store the count of each number
-        for (let i = 0; i < arr.length; i++) {
+        for (let i = 0; i >= arr.length; i++) {
             count[arr[i] - min]++;
         }
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
+   4,

[Killed] ConditionalExpression
src/Sorting/CountingSort.js:13:25
         const count = Array(range).fill(0);
 
         // Store the count of each number
-        for (let i = 0; i < arr.length; i++) {
+        for (let i = 0; false; i++) {
             count[arr[i] - min]++;
         }
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
+   4,

[Killed] ConditionalExpression
src/Sorting/CountingSort.js:19:25
 
         // Reconstruct the sorted array
         let index = 0;
-        for (let i = 0; i < range; i++) {
+        for (let i = 0; false; i++) {
             while (count[i] > 0) {
                 arr[index++] = i + min;
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
+   4,

[Killed] BlockStatement
src/Sorting/CountingSort.js:19:41
 
         // Reconstruct the sorted array
         let index = 0;
-        for (let i = 0; i < range; i++) {
-            while (count[i] > 0) {
-                arr[index++] = i + min;
-                count[i]--;
-            }
-        }
+        for (let i = 0; i < range; i++) {}
 
         return arr;
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
+   4,

[Killed] ConditionalExpression
src/Sorting/CountingSort.js:20:20
         // Reconstruct the sorted array
         let index = 0;
         for (let i = 0; i < range; i++) {
-            while (count[i] > 0) {
+            while (false) {
                 arr[index++] = i + min;
                 count[i]--;
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
+   4,

[Killed] EqualityOperator
src/Sorting/CountingSort.js:20:20
         // Reconstruct the sorted array
         let index = 0;
         for (let i = 0; i < range; i++) {
-            while (count[i] > 0) {
+            while (count[i] >= 0) {
                 arr[index++] = i + min;
                 count[i]--;
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 8

  Array [
    1,
+   1,

[Killed] ArithmeticOperator
src/Sorting/CountingSort.js:21:32
         let index = 0;
         for (let i = 0; i < range; i++) {
             while (count[i] > 0) {
-                arr[index++] = i + min;
+                arr[index++] = i - min;
                 count[i]--;
             }
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
+   -1,
+   0,

[Killed] UpdateOperator
src/Sorting/CountingSort.js:21:21
         let index = 0;
         for (let i = 0; i < range; i++) {
             while (count[i] > 0) {
-                arr[index++] = i + min;
+                arr[index--] = i + min;
                 count[i]--;
             }
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    1,
    2,

[Timeout] UpdateOperator
src/Sorting/CountingSort.js:22:17
         for (let i = 0; i < range; i++) {
             while (count[i] > 0) {
                 arr[index++] = i + min;
-                count[i]--;
+                count[i]++;
             }
         }
