[Killed] BlockStatement
src/Sorting/HeapSort.js:2:31
 class HeapSort {
-    static heapify(arr, n, i) {
-        let largest = i;
-        const left = 2 * i + 1;
-        const right = 2 * i + 2;
-
-        
-        if (left < n && arr[left] > arr[largest]) {
-            largest = left;
-        }
-
-    
-        if (right < n && arr[right] > arr[largest]) {
-            largest = right;
-        }
-
-
-        if (largest !== i) {
-            [arr[i], arr[largest]] = [arr[largest], arr[i]];  
-
-            
-            HeapSort.heapify(arr, n, largest);
-        }
-    }
+    static heapify(arr, n, i) {}
 
     static heapSort(arr) {
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
+   10,

[Killed] EqualityOperator
src/Sorting/HeapSort.js:8:25
         const right = 2 * i + 2;
 
         
-        if (left < n && arr[left] > arr[largest]) {
+        if (left < n && arr[left] <= arr[largest]) {
             largest = left;
         }
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
+   10,
    1,

[Killed] ConditionalExpression
src/Sorting/HeapSort.js:8:13
         const right = 2 * i + 2;
 
         
-        if (left < n && arr[left] > arr[largest]) {
+        if (true && arr[left] > arr[largest]) {
             largest = left;
         }
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
+   5,

[Killed] BlockStatement
src/Sorting/HeapSort.js:13:53
         }
 
     
-        if (right < n && arr[right] > arr[largest]) {
-            largest = right;
-        }
+        if (right < n && arr[right] > arr[largest]) {}
 
 
killedBy: should handle an array with unsorted values
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    1,
+   8,

[Killed] ConditionalExpression
src/Sorting/HeapSort.js:13:13
         }
 
     
-        if (right < n && arr[right] > arr[largest]) {
+        if (true && arr[right] > arr[largest]) {
             largest = right;
         }
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   3,

[Killed] BlockStatement
src/Sorting/HeapSort.js:18:28
         }
 
 
-        if (largest !== i) {
-            [arr[i], arr[largest]] = [arr[largest], arr[i]];  
-
-            
-            HeapSort.heapify(arr, n, largest);
-        }
+        if (largest !== i) {}
     }
 
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
+   10,

[Killed] BlockStatement
src/Sorting/HeapSort.js:26:26
         }
     }
 
-    static heapSort(arr) {
-        const n = arr.length;
-
-        
-        for (let i = Math.floor(n / 2) - 1; i >= 0; i--) {
-            HeapSort.heapify(arr, n, i);
-        }
-
-        
-        for (let i = n - 1; i > 0; i--) {
-            
-            [arr[0], arr[i]] = [arr[i], arr[0]]; 
-
-            
-            HeapSort.heapify(arr, i, 0);
-        }
-    }
+    static heapSort(arr) {}
 }
 
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   3,

[Killed] ConditionalExpression
src/Sorting/HeapSort.js:30:45
         const n = arr.length;
 
         
-        for (let i = Math.floor(n / 2) - 1; i >= 0; i--) {
+        for (let i = Math.floor(n / 2) - 1; false; i--) {
             HeapSort.heapify(arr, n, i);
         }
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
    3,

[Killed] BlockStatement
src/Sorting/HeapSort.js:30:58
         const n = arr.length;
 
         
-        for (let i = Math.floor(n / 2) - 1; i >= 0; i--) {
-            HeapSort.heapify(arr, n, i);
-        }
+        for (let i = Math.floor(n / 2) - 1; i >= 0; i--) {}
 
         
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
    3,

[Killed] ConditionalExpression
src/Sorting/HeapSort.js:35:29
         }
 
         
-        for (let i = n - 1; i > 0; i--) {
+        for (let i = n - 1; false; i--) {
             
             [arr[0], arr[i]] = [arr[i], arr[0]]; 
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
+   10,

[Killed] ArithmeticOperator
src/Sorting/HeapSort.js:35:22
         }
 
         
-        for (let i = n - 1; i > 0; i--) {
+        for (let i = n + 1; i > 0; i--) {
             
             [arr[0], arr[i]] = [arr[i], arr[0]]; 
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
    1,
    3,

[Killed] ArrayDeclaration
src/Sorting/HeapSort.js:37:32
         
         for (let i = n - 1; i > 0; i--) {
             
-            [arr[0], arr[i]] = [arr[i], arr[0]]; 
+            [arr[0], arr[i]] = []; 
 
             
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   3,
