[Killed] BlockStatement
src/Sorting/InsertionSort.js:2:31
 class InsertionSort {
-    static insertionSort(arr) {
-        const n = arr.length;
-        for (let i = 1; i < n; i++) {
-            let key = arr[i];
-            let j = i - 1;
-
-            while (j >= 0 && arr[j] > key) {
-                arr[j + 1] = arr[j];
-                j = j - 1;
-            }
-            arr[j + 1] = key;
-        }
-    }
+    static insertionSort(arr) {}
 }
 module.exports=InsertionSort;
killedBy: InsertionSort5 (Reverse Order)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 9

  Array [
-   1,
-   2,

[Killed] BlockStatement
src/Sorting/InsertionSort.js:4:37
 class InsertionSort {
     static insertionSort(arr) {
         const n = arr.length;
-        for (let i = 1; i < n; i++) {
-            let key = arr[i];
-            let j = i - 1;
-
-            while (j >= 0 && arr[j] > key) {
-                arr[j + 1] = arr[j];
-                j = j - 1;
-            }
-            arr[j + 1] = key;
-        }
+        for (let i = 1; i < n; i++) {}
     }
 }
killedBy: InsertionSort5 (Reverse Order)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 9

  Array [
-   1,
-   2,

[Killed] ArithmeticOperator
src/Sorting/InsertionSort.js:6:21
         const n = arr.length;
         for (let i = 1; i < n; i++) {
             let key = arr[i];
-            let j = i - 1;
+            let j = i + 1;
 
             while (j >= 0 && arr[j] > key) {
killedBy: InsertionSort4 (Identical Elements)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

@@ -2,6 +2,8 @@
    1,
    1,

[Killed] LogicalOperator
src/Sorting/InsertionSort.js:8:20
             let key = arr[i];
             let j = i - 1;
 
-            while (j >= 0 && arr[j] > key) {
+            while (j >= 0 || arr[j] > key) {
                 arr[j + 1] = arr[j];
                 j = j - 1;
killedBy: InsertionSort Negative and Positive
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   -5,
    3,

[Killed] ConditionalExpression
src/Sorting/InsertionSort.js:8:20
             let key = arr[i];
             let j = i - 1;
 
-            while (j >= 0 && arr[j] > key) {
+            while (false) {
                 arr[j + 1] = arr[j];
                 j = j - 1;
killedBy: InsertionSort5 (Reverse Order)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 9

  Array [
-   1,
-   2,

[Killed] ArithmeticOperator
src/Sorting/InsertionSort.js:9:21
             let j = i - 1;
 
             while (j >= 0 && arr[j] > key) {
-                arr[j + 1] = arr[j];
+                arr[j - 1] = arr[j];
                 j = j - 1;
             }
killedBy: InsertionSort5 (Reverse Order)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 8

  Array [
    1,
    2,

[Timeout] ArithmeticOperator
src/Sorting/InsertionSort.js:10:21
 
             while (j >= 0 && arr[j] > key) {
                 arr[j + 1] = arr[j];
-                j = j - 1;
+                j = j + 1;
             }
             arr[j + 1] = key;

[Killed] ArithmeticOperator
src/Sorting/InsertionSort.js:12:17
                 arr[j + 1] = arr[j];
                 j = j - 1;
             }
-            arr[j + 1] = key;
+            arr[j - 1] = key;
         }
     }
killedBy: InsertionSort4 (Identical Elements)
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 1, 1, 1, 1]
Received: serializes to the same string
