[Killed] ArithmeticOperator
src/Sorting/MergeSort.js:4:20
 class MergeSort {
     // Merge function that merges two sorted halves
     merge(arr, left, mid, right) {
-        const n1 = mid - left + 1;
+        const n1 = mid + left + 1;
         const n2 = right - mid;
 
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 9

  Array [
    3,
+   3,

[Killed] ArithmeticOperator
src/Sorting/MergeSort.js:4:20
 class MergeSort {
     // Merge function that merges two sorted halves
     merge(arr, left, mid, right) {
-        const n1 = mid - left + 1;
+        const n1 = mid - left - 1;
         const n2 = right - mid;
 
killedBy: MergeSort1
statusReason: RangeError: Invalid array length

[Killed] ArithmeticOperator
src/Sorting/MergeSort.js:5:20
     // Merge function that merges two sorted halves
     merge(arr, left, mid, right) {
         const n1 = mid - left + 1;
-        const n2 = right - mid;
+        const n2 = right + mid;
 
         // Create temporary arrays
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 10

  Array [
    3,
    9,

[Survived] ArrayDeclaration
src/Sorting/MergeSort.js:9:28
 
         // Create temporary arrays
         const leftArray = new Array(n1);
-        const rightArray = new Array(n2);
+        const rightArray = new Array();
 
         // Copy data to temporary arrays leftArray[] and rightArray[]

[Killed] EqualityOperator
src/Sorting/MergeSort.js:12:25
         const rightArray = new Array(n2);
 
         // Copy data to temporary arrays leftArray[] and rightArray[]
-        for (let i = 0; i < n1; i++) {
+        for (let i = 0; i >= n1; i++) {
             leftArray[i] = arr[left + i];
         }
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
-   3,
-   9,

[Killed] BlockStatement
src/Sorting/MergeSort.js:12:38
         const rightArray = new Array(n2);
 
         // Copy data to temporary arrays leftArray[] and rightArray[]
-        for (let i = 0; i < n1; i++) {
-            leftArray[i] = arr[left + i];
-        }
+        for (let i = 0; i < n1; i++) {}
         for (let j = 0; j < n2; j++) {
             rightArray[j] = arr[mid + 1 + j];
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
-   3,
-   9,

[Killed] ArithmeticOperator
src/Sorting/MergeSort.js:13:32
 
         // Copy data to temporary arrays leftArray[] and rightArray[]
         for (let i = 0; i < n1; i++) {
-            leftArray[i] = arr[left + i];
+            leftArray[i] = arr[left - i];
         }
         for (let j = 0; j < n2; j++) {
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
    3,
    9,

[Killed] ConditionalExpression
src/Sorting/MergeSort.js:15:25
         for (let i = 0; i < n1; i++) {
             leftArray[i] = arr[left + i];
         }
-        for (let j = 0; j < n2; j++) {
+        for (let j = 0; false; j++) {
             rightArray[j] = arr[mid + 1 + j];
         }
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
-   3,
-   9,

[Killed] EqualityOperator
src/Sorting/MergeSort.js:15:25
         for (let i = 0; i < n1; i++) {
             leftArray[i] = arr[left + i];
         }
-        for (let j = 0; j < n2; j++) {
+        for (let j = 0; j >= n2; j++) {
             rightArray[j] = arr[mid + 1 + j];
         }
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
-   3,
-   9,

[Killed] ArithmeticOperator
src/Sorting/MergeSort.js:16:33
             leftArray[i] = arr[left + i];
         }
         for (let j = 0; j < n2; j++) {
-            rightArray[j] = arr[mid + 1 + j];
+            rightArray[j] = arr[mid + 1 - j];
         }
 
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    3,
    9,

[Killed] ArithmeticOperator
src/Sorting/MergeSort.js:16:33
             leftArray[i] = arr[left + i];
         }
         for (let j = 0; j < n2; j++) {
-            rightArray[j] = arr[mid + 1 + j];
+            rightArray[j] = arr[mid - 1 + j];
         }
 
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   3,
+   undefined,

[Killed] ConditionalExpression
src/Sorting/MergeSort.js:24:16
         let k = left; // Initial index for the merged array
 
         // Merge the temp arrays back into arr[left..right]
-        while (i < n1 && j < n2) {
+        while (false) {
             if (leftArray[i] <= rightArray[j]) {
                 arr[k++] = leftArray[i++];
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   3,
-   9,

[Killed] EqualityOperator
src/Sorting/MergeSort.js:24:26
         let k = left; // Initial index for the merged array
 
         // Merge the temp arrays back into arr[left..right]
-        while (i < n1 && j < n2) {
+        while (i < n1 && j <= n2) {
             if (leftArray[i] <= rightArray[j]) {
                 arr[k++] = leftArray[i++];
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 6

  Array [
+   undefined,
+   undefined,

[Killed] ConditionalExpression
src/Sorting/MergeSort.js:25:17
 
         // Merge the temp arrays back into arr[left..right]
         while (i < n1 && j < n2) {
-            if (leftArray[i] <= rightArray[j]) {
+            if (false) {
                 arr[k++] = leftArray[i++];
             } else {
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   3,
-   9,

[Killed] EqualityOperator
src/Sorting/MergeSort.js:25:17
 
         // Merge the temp arrays back into arr[left..right]
         while (i < n1 && j < n2) {
-            if (leftArray[i] <= rightArray[j]) {
+            if (leftArray[i] > rightArray[j]) {
                 arr[k++] = leftArray[i++];
             } else {
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
-   3,
-   9,

[Killed] UpdateOperator
src/Sorting/MergeSort.js:26:21
         // Merge the temp arrays back into arr[left..right]
         while (i < n1 && j < n2) {
             if (leftArray[i] <= rightArray[j]) {
-                arr[k++] = leftArray[i++];
+                arr[k--] = leftArray[i++];
             } else {
                 arr[k++] = rightArray[j++];
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
+   38,
+   27,

[Killed] UpdateOperator
src/Sorting/MergeSort.js:26:38
         // Merge the temp arrays back into arr[left..right]
         while (i < n1 && j < n2) {
             if (leftArray[i] <= rightArray[j]) {
-                arr[k++] = leftArray[i++];
+                arr[k++] = leftArray[i--];
             } else {
                 arr[k++] = rightArray[j++];
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 5

  Array [
+   undefined,
    3,

[Timeout] BlockStatement
src/Sorting/MergeSort.js:27:20
         while (i < n1 && j < n2) {
             if (leftArray[i] <= rightArray[j]) {
                 arr[k++] = leftArray[i++];
-            } else {
-                arr[k++] = rightArray[j++];
-            }
+            } else {}
         }
 

[Killed] UpdateOperator
src/Sorting/MergeSort.js:28:21
             if (leftArray[i] <= rightArray[j]) {
                 arr[k++] = leftArray[i++];
             } else {
-                arr[k++] = rightArray[j++];
+                arr[k--] = rightArray[j++];
             }
         }
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
    3,
-   9,

[Timeout] UpdateOperator
src/Sorting/MergeSort.js:28:39
             if (leftArray[i] <= rightArray[j]) {
                 arr[k++] = leftArray[i++];
             } else {
-                arr[k++] = rightArray[j++];
+                arr[k++] = rightArray[j--];
             }
         }

[Killed] ConditionalExpression
src/Sorting/MergeSort.js:33:16
         }
 
         // Copy the remaining elements of leftArray[], if any
-        while (i < n1) {
+        while (false) {
             arr[k++] = leftArray[i++];
         }
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
    3,
+   3,

[Killed] EqualityOperator
src/Sorting/MergeSort.js:33:16
         }
 
         // Copy the remaining elements of leftArray[], if any
-        while (i < n1) {
+        while (i <= n1) {
             arr[k++] = leftArray[i++];
         }
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 5

  Array [
+   undefined,
    3,

[Killed] UpdateOperator
src/Sorting/MergeSort.js:34:17
 
         // Copy the remaining elements of leftArray[], if any
         while (i < n1) {
-            arr[k++] = leftArray[i++];
+            arr[k--] = leftArray[i++];
         }
 
killedBy: MergeSort5 (Descending Order)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 7

  Array [
-   1,
-   2,

[Timeout] UpdateOperator
src/Sorting/MergeSort.js:34:34
 
         // Copy the remaining elements of leftArray[], if any
         while (i < n1) {
-            arr[k++] = leftArray[i++];
+            arr[k++] = leftArray[i--];
         }
 

[Killed] EqualityOperator
src/Sorting/MergeSort.js:38:16
         }
 
         // Copy the remaining elements of rightArray[], if any
-        while (j < n2) {
+        while (j <= n2) {
             arr[k++] = rightArray[j++];
         }
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 5

  Array [
+   undefined,
    3,

[Survived] ConditionalExpression
src/Sorting/MergeSort.js:38:16
         }
 
         // Copy the remaining elements of rightArray[], if any
-        while (j < n2) {
+        while (false) {
             arr[k++] = rightArray[j++];
         }

[Killed] UpdateOperator
src/Sorting/MergeSort.js:39:17
 
         // Copy the remaining elements of rightArray[], if any
         while (j < n2) {
-            arr[k++] = rightArray[j++];
+            arr[k--] = rightArray[j++];
         }
     }
killedBy: MergeSortAlreadySorted
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
    2,

[Timeout] UpdateOperator
src/Sorting/MergeSort.js:39:35
 
         // Copy the remaining elements of rightArray[], if any
         while (j < n2) {
-            arr[k++] = rightArray[j++];
+            arr[k++] = rightArray[j--];
         }
     }

[Killed] BlockStatement
src/Sorting/MergeSort.js:44:33
     }
 
     // Merge Sort function that recursively splits the array
-    mergeSort(arr, left, right) {
-        if (left < right) {
-            const mid = Math.floor((left + right) / 2);
-
-            // Recursively divide the array into two halves
-            this.mergeSort(arr, left, mid);
-            this.mergeSort(arr, mid + 1, right);
-
-            // Merge the sorted halves
-            this.merge(arr, left, mid, right);
-        }
-    }
+    mergeSort(arr, left, right) {}
 }
 module.exports=MergeSort;
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   3,
-   9,

[Killed] BlockStatement
src/Sorting/MergeSort.js:45:27
 
     // Merge Sort function that recursively splits the array
     mergeSort(arr, left, right) {
-        if (left < right) {
-            const mid = Math.floor((left + right) / 2);
-
-            // Recursively divide the array into two halves
-            this.mergeSort(arr, left, mid);
-            this.mergeSort(arr, mid + 1, right);
-
-            // Merge the sorted halves
-            this.merge(arr, left, mid, right);
-        }
+        if (left < right) {}
     }
 }
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   3,
-   9,

[Killed] ConditionalExpression
src/Sorting/MergeSort.js:45:13
 
     // Merge Sort function that recursively splits the array
     mergeSort(arr, left, right) {
-        if (left < right) {
+        if (false) {
             const mid = Math.floor((left + right) / 2);
 
killedBy: MergeSort1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   3,
-   9,

[Timeout] ArithmeticOperator
src/Sorting/MergeSort.js:46:36
     // Merge Sort function that recursively splits the array
     mergeSort(arr, left, right) {
         if (left < right) {
-            const mid = Math.floor((left + right) / 2);
+            const mid = Math.floor((left + right) * 2);
 
             // Recursively divide the array into two halves

[Timeout] ArithmeticOperator
src/Sorting/MergeSort.js:46:37
     // Merge Sort function that recursively splits the array
     mergeSort(arr, left, right) {
         if (left < right) {
-            const mid = Math.floor((left + right) / 2);
+            const mid = Math.floor((left - right) / 2);
 
             // Recursively divide the array into two halves

[Timeout] ArithmeticOperator
src/Sorting/MergeSort.js:50:33
 
             // Recursively divide the array into two halves
             this.mergeSort(arr, left, mid);
-            this.mergeSort(arr, mid + 1, right);
+            this.mergeSort(arr, mid - 1, right);
 
             // Merge the sorted halves
