[Killed] BlockStatement
src/Sorting/QuickSort.js:3:38
 class QuickSort {
 
-    static partition(arr, low, high) {
-        const pivot = arr[high];
-        let i = low - 1;
-
-        for (let j = low; j < high; j++) {
-            if (arr[j] < pivot) {
-                i++;
-                
-                [arr[i], arr[j]] = [arr[j], arr[i]];
-            }
-        }
-
-        
-        [arr[i + 1], arr[high]] = [arr[high], arr[i + 1]];
-
-        return i + 1;
-    }
+    static partition(arr, low, high) {}
 
     static quickSort(arr, low, high) {
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   5,

[Killed] ConditionalExpression
src/Sorting/QuickSort.js:7:27
         const pivot = arr[high];
         let i = low - 1;
 
-        for (let j = low; j < high; j++) {
+        for (let j = low; false; j++) {
             if (arr[j] < pivot) {
                 i++;
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    5,

[Killed] EqualityOperator
src/Sorting/QuickSort.js:7:27
         const pivot = arr[high];
         let i = low - 1;
 
-        for (let j = low; j < high; j++) {
+        for (let j = low; j >= high; j++) {
             if (arr[j] < pivot) {
                 i++;
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    5,

[Killed] BlockStatement
src/Sorting/QuickSort.js:8:33
         let i = low - 1;
 
         for (let j = low; j < high; j++) {
-            if (arr[j] < pivot) {
-                i++;
-                
-                [arr[i], arr[j]] = [arr[j], arr[i]];
-            }
+            if (arr[j] < pivot) {}
         }
 
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    5,

[Killed] ConditionalExpression
src/Sorting/QuickSort.js:8:17
         let i = low - 1;
 
         for (let j = low; j < high; j++) {
-            if (arr[j] < pivot) {
+            if (false) {
                 i++;
                 
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    5,

[Timeout] UpdateOperator
src/Sorting/QuickSort.js:9:17
 
         for (let j = low; j < high; j++) {
             if (arr[j] < pivot) {
-                i++;
+                i--;
                 
                 [arr[i], arr[j]] = [arr[j], arr[i]];

[Killed] ArithmeticOperator
src/Sorting/QuickSort.js:16:14
         }
 
         
-        [arr[i + 1], arr[high]] = [arr[high], arr[i + 1]];
+        [arr[i - 1], arr[high]] = [arr[high], arr[i + 1]];
 
         return i + 1;
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   5,

[Killed] ArithmeticOperator
src/Sorting/QuickSort.js:16:51
         }
 
         
-        [arr[i + 1], arr[high]] = [arr[high], arr[i + 1]];
+        [arr[i + 1], arr[high]] = [arr[high], arr[i - 1]];
 
         return i + 1;
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
    1,
    5,

[Timeout] ArithmeticOperator
src/Sorting/QuickSort.js:18:16
         
         [arr[i + 1], arr[high]] = [arr[high], arr[i + 1]];
 
-        return i + 1;
+        return i - 1;
     }
 

[Killed] BlockStatement
src/Sorting/QuickSort.js:21:38
         return i + 1;
     }
 
-    static quickSort(arr, low, high) {
-        if (low < high) {
-            const pivotIndex = QuickSort.partition(arr, low, high);
-            QuickSort.quickSort(arr, low, pivotIndex - 1);
-            QuickSort.quickSort(arr, pivotIndex + 1, high);
-        }
-    }
+    static quickSort(arr, low, high) {}
 }
 
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   5,

[Killed] ConditionalExpression
src/Sorting/QuickSort.js:22:13
     }
 
     static quickSort(arr, low, high) {
-        if (low < high) {
+        if (false) {
             const pivotIndex = QuickSort.partition(arr, low, high);
             QuickSort.quickSort(arr, low, pivotIndex - 1);
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   5,

[Killed] BlockStatement
src/Sorting/QuickSort.js:22:25
     }
 
     static quickSort(arr, low, high) {
-        if (low < high) {
-            const pivotIndex = QuickSort.partition(arr, low, high);
-            QuickSort.quickSort(arr, low, pivotIndex - 1);
-            QuickSort.quickSort(arr, pivotIndex + 1, high);
-        }
+        if (low < high) {}
     }
 }
killedBy: should sort an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   5,

[Timeout] ArithmeticOperator
src/Sorting/QuickSort.js:24:43
     static quickSort(arr, low, high) {
         if (low < high) {
             const pivotIndex = QuickSort.partition(arr, low, high);
-            QuickSort.quickSort(arr, low, pivotIndex - 1);
+            QuickSort.quickSort(arr, low, pivotIndex + 1);
             QuickSort.quickSort(arr, pivotIndex + 1, high);
         }

[Timeout] ArithmeticOperator
src/Sorting/QuickSort.js:25:38
         if (low < high) {
             const pivotIndex = QuickSort.partition(arr, low, high);
             QuickSort.quickSort(arr, low, pivotIndex - 1);
-            QuickSort.quickSort(arr, pivotIndex + 1, high);
+            QuickSort.quickSort(arr, pivotIndex - 1, high);
         }
     }
