[Killed] BlockStatement
src/linkedlist.js:2:23
 class Node {
-    constructor(data) {
-        this.data = data;
-        this.next = null;
-    }
+    constructor(data) {}
 }
 
killedBy: Linked List Operations insertAtFront - insert into empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   10,
+   undefined,

[Killed] BlockStatement
src/linkedlist.js:8:39
     }
 }
 
-function insertAtFront(head, newData) {
-    const newNode = new Node(newData);
-    newNode.next = head;
-    return newNode;
-}
+function insertAtFront(head, newData) {}
 
 function append(head, newData) {
killedBy: Linked List Operations insertAtFront - insert into empty list
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
src/linkedlist.js:14:32
     return newNode;
 }
 
-function append(head, newData) {
-    const newNode = new Node(newData);
-    if (head === null) {
-        return newNode;
-    }
-    let last = head;
-    while (last.next !== null) {
-        last = last.next;
-    }
-    last.next = newNode;
-    return head;
-}
+function append(head, newData) {}
 
 
killedBy: Linked List Operations append - append to empty list
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
src/linkedlist.js:16:24
 
 function append(head, newData) {
     const newNode = new Node(newData);
-    if (head === null) {
-        return newNode;
-    }
+    if (head === null) {}
     let last = head;
     while (last.next !== null) {
killedBy: Linked List Operations append - append to empty list
statusReason: TypeError: Cannot read properties of null (reading 'next')

[Killed] ConditionalExpression
src/linkedlist.js:16:9
 
 function append(head, newData) {
     const newNode = new Node(newData);
-    if (head === null) {
+    if (false) {
         return newNode;
     }
killedBy: Linked List Operations append - append to empty list
statusReason: TypeError: Cannot read properties of null (reading 'next')

[Killed] ConditionalExpression
src/linkedlist.js:20:12
         return newNode;
     }
     let last = head;
-    while (last.next !== null) {
+    while (false) {
         last = last.next;
     }
killedBy: Linked List Operations removeLastNode - remove from list with multiple nodes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    10,
-   20,

[Killed] EqualityOperator
src/linkedlist.js:20:12
         return newNode;
     }
     let last = head;
-    while (last.next !== null) {
+    while (last.next === null) {
         last = last.next;
     }
killedBy: Linked List Operations append - append to non-empty list
statusReason: TypeError: Cannot read properties of null (reading 'next')

[Killed] BlockStatement
src/linkedlist.js:29:27
 
 
 // Function to delete the head node and return the new head
-function deleteHead(head) {
-    if (head === null) {
-        return null;
-    }
-
-    const temp = head;
-    head = head.next;
-    temp.next = null;  // Help garbage collection
-    return head;
-}
+function deleteHead(head) {}
 
 // Function to remove the last node from the list
killedBy: Linked List Operations deleteHead - delete head of list
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] EqualityOperator
src/linkedlist.js:30:9
 
 // Function to delete the head node and return the new head
 function deleteHead(head) {
-    if (head === null) {
+    if (head !== null) {
         return null;
     }
killedBy: Linked List Operations deleteHead - delete head of list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   20,
- ]

[Killed] ConditionalExpression
src/linkedlist.js:30:9
 
 // Function to delete the head node and return the new head
 function deleteHead(head) {
-    if (head === null) {
+    if (false) {
         return null;
     }
killedBy: Linked List Operations deleteHead - delete head of empty list
statusReason: TypeError: Cannot read properties of null (reading 'next')

[Killed] BlockStatement
src/linkedlist.js:41:31
 }
 
 // Function to remove the last node from the list
-function removeLastNode(head) {
-    if (head === null || head.next === null) {
-        return null;
-    }
-
-    let secondLast = head;
-    while (secondLast.next !== null && secondLast.next.next !== null) {
-        secondLast = secondLast.next;
-    }
-
-    secondLast.next = null;
-    return head;
-}
+function removeLastNode(head) {}
 
 // Function to insert a node at a specific position
killedBy: Linked List Operations removeLastNode - remove from list with multiple nodes
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
src/linkedlist.js:42:46
 
 // Function to remove the last node from the list
 function removeLastNode(head) {
-    if (head === null || head.next === null) {
-        return null;
-    }
+    if (head === null || head.next === null) {}
 
     let secondLast = head;
killedBy: Linked List Operations removeLastNode - remove last from list with single node
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   10,

[Killed] LogicalOperator
src/linkedlist.js:42:9
 
 // Function to remove the last node from the list
 function removeLastNode(head) {
-    if (head === null || head.next === null) {
+    if (head === null && head.next === null) {
         return null;
     }
killedBy: Linked List Operations removeLastNode - remove last from list with single node
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   10,

[Killed] ConditionalExpression
src/linkedlist.js:47:40
     }
 
     let secondLast = head;
-    while (secondLast.next !== null && secondLast.next.next !== null) {
+    while (secondLast.next !== null && true) {
         secondLast = secondLast.next;
     }
killedBy: Linked List Operations removeLastNode - remove from list with multiple nodes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    10,
    20,

[Killed] EqualityOperator
src/linkedlist.js:47:40
     }
 
     let secondLast = head;
-    while (secondLast.next !== null && secondLast.next.next !== null) {
+    while (secondLast.next !== null && secondLast.next.next === null) {
         secondLast = secondLast.next;
     }
killedBy: Linked List Operations removeLastNode - remove from list with multiple nodes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    10,
-   20,

[Killed] EqualityOperator
src/linkedlist.js:57:9
 
 // Function to insert a node at a specific position
 function insertAtPosition(head, position, newData) {
-    if (position < 1) return head;
+    if (position <= 1) return head;
 
     const newNode = new Node(newData);
killedBy: Linked List Operations insertAtPosition - insert at position 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   20,
    10,

[Killed] ConditionalExpression
src/linkedlist.js:57:9
 
 // Function to insert a node at a specific position
 function insertAtPosition(head, position, newData) {
-    if (position < 1) return head;
+    if (true) return head;
 
     const newNode = new Node(newData);
killedBy: Linked List Operations insertAtPosition - insert at position 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   20,
    10,

[Killed] EqualityOperator
src/linkedlist.js:61:9
 
     const newNode = new Node(newData);
 
-    if (position === 1) {
+    if (position !== 1) {
         newNode.next = head;
         return newNode;
killedBy: Linked List Operations insertAtPosition - insert at position 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   20,
    10,

[Killed] BlockStatement
src/linkedlist.js:61:25
 
     const newNode = new Node(newData);
 
-    if (position === 1) {
-        newNode.next = head;
-        return newNode;
-    }
+    if (position === 1) {}
 
     let current = head;
killedBy: Linked List Operations insertAtPosition - insert at position 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   20,
    10,

[Killed] ConditionalExpression
src/linkedlist.js:69:32
     let current = head;
     let count = 1;
 
-    while (current !== null && count < position - 1) {
+    while (current !== null && true) {
         current = current.next;
         count++;
killedBy: Linked List Operations insertAtPosition - correct insertion after mutant modifies count to --
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    10,
-   30,

[Killed] EqualityOperator
src/linkedlist.js:69:32
     let current = head;
     let count = 1;
 
-    while (current !== null && count < position - 1) {
+    while (current !== null && count <= position - 1) {
         current = current.next;
         count++;
killedBy: Linked List Operations insertAtPosition - correct insertion after mutant modifies count to --
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    10,
-   30,

[Killed] UpdateOperator
src/linkedlist.js:71:9
 
     while (current !== null && count < position - 1) {
         current = current.next;
-        count++;
+        count--;
     }
 
killedBy: Linked List Operations insertAtPosition - insert at the end
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    10,
    20,

[Killed] ConditionalExpression
src/linkedlist.js:74:9
         count++;
     }
 
-    if (current === null) {
+    if (true) {
         return head;
     }
killedBy: Linked List Operations insertAtPosition - correct insertion after mutant modifies count to --
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    10,
-   30,

[Killed] EqualityOperator
src/linkedlist.js:74:9
         count++;
     }
 
-    if (current === null) {
+    if (current !== null) {
         return head;
     }
killedBy: Linked List Operations insertAtPosition - insert at invalid position
statusReason: TypeError: Cannot read properties of null (reading 'next')

[Killed] BlockStatement
src/linkedlist.js:84:43
 }
 
 // Function to delete a node at a given position
-function deleteAtPosition(head, position) {
-    if (head === null) return head;
-
-    if (position === 1) {
-        head = head.next;
-        return head;
-    }
-
-    let current = head;
-    let count = 1;
-
-    while (current !== null && count < position - 1) {
-        current = current.next;
-        count++;
-    }
-
-    if (current === null || current.next === null) {
-        return head;
-    }
-
-    current.next = current.next.next;
-    return head;
-}
+function deleteAtPosition(head, position) {}
 
 // Function to reverse the linked list
killedBy: Linked List Operations deleteAtPosition - delete from position 1
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] EqualityOperator
src/linkedlist.js:85:9
 
 // Function to delete a node at a given position
 function deleteAtPosition(head, position) {
-    if (head === null) return head;
+    if (head !== null) return head;
 
     if (position === 1) {
killedBy: Linked List Operations deleteAtPosition - delete from position 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   10,
    20,

[Killed] ConditionalExpression
src/linkedlist.js:85:9
 
 // Function to delete a node at a given position
 function deleteAtPosition(head, position) {
-    if (head === null) return head;
+    if (false) return head;
 
     if (position === 1) {
killedBy: Linked List Operations deleteAtPosition - delete from empty list
statusReason: TypeError: Cannot read properties of null (reading 'next')

[Killed] ConditionalExpression
src/linkedlist.js:87:9
 function deleteAtPosition(head, position) {
     if (head === null) return head;
 
-    if (position === 1) {
+    if (false) {
         head = head.next;
         return head;
killedBy: Linked List Operations deleteAtPosition - delete from position 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   20,
+   10,

[Killed] EqualityOperator
src/linkedlist.js:95:12
     let current = head;
     let count = 1;
 
-    while (current !== null && count < position - 1) {
+    while (current === null && count < position - 1) {
         current = current.next;
         count++;
killedBy: Linked List Operations deleteAtPosition - invalid position
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    10,
-   20,

[Killed] BlockStatement
src/linkedlist.js:100:52
         count++;
     }
 
-    if (current === null || current.next === null) {
-        return head;
-    }
+    if (current === null || current.next === null) {}
 
     current.next = current.next.next;
killedBy: Linked List Operations deleteAtPosition - invalid position
statusReason: TypeError: Cannot read properties of null (reading 'next')

[Killed] EqualityOperator
src/linkedlist.js:100:29
         count++;
     }
 
-    if (current === null || current.next === null) {
+    if (current === null || current.next !== null) {
         return head;
     }
killedBy: Linked List Operations deleteAtPosition - delete from position 2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    10,
+   20,

[Killed] BlockStatement
src/linkedlist.js:109:28
 }
 
 // Function to reverse the linked list
-function reverseList(head) {
-    let prev = null;
-    let current = head;
-    let next = null;
-
-    while (current !== null) {
-        next = current.next;
-        current.next = prev;
-        prev = current;
-        current = next;
-    }
-
-    return prev;
-}
+function reverseList(head) {}
 
 // Function to count the number of nodes in the list
killedBy: Linked List Operations reverseList - reverse list with single node
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] ConditionalExpression
src/linkedlist.js:114:12
     let current = head;
     let next = null;
 
-    while (current !== null) {
+    while (false) {
         next = current.next;
         current.next = prev;
killedBy: Linked List Operations reverseList - reverse list with single node
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   10,
- ]

[Killed] EqualityOperator
src/linkedlist.js:114:12
     let current = head;
     let next = null;
 
-    while (current !== null) {
+    while (current === null) {
         next = current.next;
         current.next = prev;
killedBy: Linked List Operations reverseList - reverse list with single node
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   10,
- ]

[Killed] BlockStatement
src/linkedlist.js:125:27
 }
 
 // Function to count the number of nodes in the list
-function countNodes(head) {
-    let count = 0;
-    let current = head;
-
-    while (current !== null) {
-        count++;
-        current = current.next;
-    }
-
-    return count;
-}
+function countNodes(head) {}
 
 // Function to rotate the linked list left by k nodes
killedBy: Linked List Operations countNodes - count nodes in an empty list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] UpdateOperator
src/linkedlist.js:130:9
     let current = head;
 
     while (current !== null) {
-        count++;
+        count--;
         current = current.next;
     }
killedBy: Linked List Operations countNodes - count nodes in a list with one node
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] ConditionalExpression
src/linkedlist.js:139:9
 
 // Function to rotate the linked list left by k nodes
 function rotate(head, k) {
-    if (k === 0 || head === null) return head;
+    if (true) return head;
 
     let length = countNodes(head);
killedBy: Linked List Operations rotate - large k with multiple rotations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   30,
-   40,

[Killed] EqualityOperator
src/linkedlist.js:139:9
 
 // Function to rotate the linked list left by k nodes
 function rotate(head, k) {
-    if (k === 0 || head === null) return head;
+    if (k !== 0 || head === null) return head;
 
     let length = countNodes(head);
killedBy: Linked List Operations rotate - large k with multiple rotations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   30,
-   40,

[Killed] ArithmeticOperator
src/linkedlist.js:142:9
     if (k === 0 || head === null) return head;
 
     let length = countNodes(head);
-    k = k % length; // Handle k greater than list length
+    k = k * length; // Handle k greater than list length
 
     if (k === 0) return head;
killedBy: Linked List Operations rotate - large k with multiple rotations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   30,
-   40,

[Killed] ConditionalExpression
src/linkedlist.js:144:9
     let length = countNodes(head);
     k = k % length; // Handle k greater than list length
 
-    if (k === 0) return head;
+    if (false) return head;
 
     let current = head;
killedBy: Linked List Operations rotate - rotate by length of list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   10,
    20,

[Killed] EqualityOperator
src/linkedlist.js:144:9
     let length = countNodes(head);
     k = k % length; // Handle k greater than list length
 
-    if (k === 0) return head;
+    if (k !== 0) return head;
 
     let current = head;
killedBy: Linked List Operations rotate - rotate by length of list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   10,
    20,

[Killed] LogicalOperator
src/linkedlist.js:150:12
     let count = 1;
 
     // Traverse to the kth node
-    while (count < k && current !== null) {
+    while (count < k || current !== null) {
         current = current.next;
         count++;
killedBy: Linked List Operations rotate - large k with multiple rotations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   30,
-   40,

[Killed] EqualityOperator
src/linkedlist.js:150:25
     let count = 1;
 
     // Traverse to the kth node
-    while (count < k && current !== null) {
+    while (count < k && current === null) {
         current = current.next;
         count++;
killedBy: Linked List Operations rotate - large k with multiple rotations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   20,
    30,

[Killed] EqualityOperator
src/linkedlist.js:155:9
         count++;
     }
 
-    if (current === null) return head;
+    if (current !== null) return head;
 
     let kthNode = current;
killedBy: Linked List Operations rotate - large k with multiple rotations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   30,
-   40,

[Killed] ConditionalExpression
src/linkedlist.js:155:9
         count++;
     }
 
-    if (current === null) return head;
+    if (true) return head;
 
     let kthNode = current;
killedBy: Linked List Operations rotate - large k with multiple rotations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   30,
-   40,

[Killed] EqualityOperator
src/linkedlist.js:159:12
 
     let kthNode = current;
     let lastNode = head;
-    while (lastNode.next !== null) {
+    while (lastNode.next === null) {
         lastNode = lastNode.next;
     }
killedBy: Linked List Operations rotate - large k with multiple rotations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 0

  Array [
    30,
    40,

[Killed] ConditionalExpression
src/linkedlist.js:159:12
 
     let kthNode = current;
     let lastNode = head;
-    while (lastNode.next !== null) {
+    while (false) {
         lastNode = lastNode.next;
     }
killedBy: Linked List Operations rotate - large k with multiple rotations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 0

  Array [
    30,
    40,

[Killed] EqualityOperator
src/linkedlist.js:176:12
     let resStart = null, resEnd = null;
     let curr = head, prev = null;
 
-    while (curr !== null) {
+    while (curr === null) {
         if (curr.data % 2 === 0) {
             if (prev !== null) {
killedBy: Linked List Operations segregateEvenOdd - segregate even and odd nodes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    10,
-   20,

[Killed] ConditionalExpression
src/linkedlist.js:176:12
     let resStart = null, resEnd = null;
     let curr = head, prev = null;
 
-    while (curr !== null) {
+    while (false) {
         if (curr.data % 2 === 0) {
             if (prev !== null) {
killedBy: Linked List Operations segregateEvenOdd - segregate even and odd nodes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    10,
-   20,

[Killed] ConditionalExpression
src/linkedlist.js:177:13
     let curr = head, prev = null;
 
     while (curr !== null) {
-        if (curr.data % 2 === 0) {
+        if (false) {
             if (prev !== null) {
                 prev.next = curr.next;
killedBy: Linked List Operations segregateEvenOdd - segregate even and odd nodes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    10,
-   20,

[Killed] ArithmeticOperator
src/linkedlist.js:177:13
     let curr = head, prev = null;
 
     while (curr !== null) {
-        if (curr.data % 2 === 0) {
+        if (curr.data * 2 === 0) {
             if (prev !== null) {
                 prev.next = curr.next;
killedBy: Linked List Operations segregateEvenOdd - segregate even and odd nodes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    10,
-   20,

[Killed] ConditionalExpression
src/linkedlist.js:178:17
 
     while (curr !== null) {
         if (curr.data % 2 === 0) {
-            if (prev !== null) {
+            if (true) {
                 prev.next = curr.next;
             } else {
killedBy: Linked List Operations segregateEvenOdd - segregate even and odd nodes
statusReason: TypeError: Cannot set properties of null (setting 'next')

[Killed] ConditionalExpression
src/linkedlist.js:178:17
 
     while (curr !== null) {
         if (curr.data % 2 === 0) {
-            if (prev !== null) {
+            if (false) {
                 prev.next = curr.next;
             } else {
killedBy: Linked List Operations segregateEvenOdd - segregate even and odd nodes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    10,
    20,

[Timeout] BlockStatement
src/linkedlist.js:180:20
         if (curr.data % 2 === 0) {
             if (prev !== null) {
                 prev.next = curr.next;
-            } else {
-                head = curr.next;
-            }
+            } else {}
 
             if (resStart === null) {

[Killed] EqualityOperator
src/linkedlist.js:184:17
                 head = curr.next;
             }
 
-            if (resStart === null) {
+            if (resStart !== null) {
                 resStart = curr;
                 resEnd = resStart;
killedBy: Linked List Operations segregateEvenOdd - segregate even and odd nodes
statusReason: TypeError: Cannot set properties of null (setting 'next')

[Killed] BlockStatement
src/linkedlist.js:184:36
                 head = curr.next;
             }
 
-            if (resStart === null) {
-                resStart = curr;
-                resEnd = resStart;
-            } else {
+            if (resStart === null) {} else {
                 resEnd.next = curr;
                 resEnd = resEnd.next;
killedBy: Linked List Operations segregateEvenOdd - segregate even and odd nodes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 0

  Array [
-   10,
-   20,

[Killed] BlockStatement
src/linkedlist.js:187:20
             if (resStart === null) {
                 resStart = curr;
                 resEnd = resStart;
-            } else {
-                resEnd.next = curr;
-                resEnd = resEnd.next;
-            }
+            } else {}
 
             curr = curr.next;
killedBy: Linked List Operations segregateEvenOdd - segregate even and odd nodes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    10,
-   20,

[Timeout] BlockStatement
src/linkedlist.js:193:16
             }
 
             curr = curr.next;
-        } else {
-            prev = curr;
-            curr = curr.next;
-        }
+        } else {}
     }
 

[Killed] EqualityOperator
src/linkedlist.js:199:9
         }
     }
 
-    if (resStart === null) return head;
+    if (resStart !== null) return head;
 
     resEnd.next = head;
killedBy: Linked List Operations segregateEvenOdd - segregate even and odd nodes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 0

  Array [
-   10,
-   20,

[Killed] ConditionalExpression
src/linkedlist.js:199:9
         }
     }
 
-    if (resStart === null) return head;
+    if (true) return head;
 
     resEnd.next = head;
killedBy: Linked List Operations segregateEvenOdd - segregate even and odd nodes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 0

  Array [
-   10,
-   20,

[Killed] BlockStatement
src/linkedlist.js:206:24
 }
 
 // Helper function to display the linked list as an array (for testing)
-function display(head) {
-    let result = [];
-    let current = head;
-
-    while (current !== null) {
-        result.push(current.data);
-        current = current.next;
-    }
-
-    return result;
-}
+function display(head) {}
 // Export all functions and Node class
 module.exports = {
killedBy: Linked List Operations insertAtFront - insert into empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [10]
Received: undefined

[Killed] ArrayDeclaration
src/linkedlist.js:207:18
 
 // Helper function to display the linked list as an array (for testing)
 function display(head) {
-    let result = [];
+    let result = ["Stryker was here"];
     let current = head;
 
killedBy: Linked List Operations insertAtFront - insert into empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "Stryker was here",
    10,

[Killed] ObjectLiteral
src/linkedlist.js:218:18
     return result;
 }
 // Export all functions and Node class
-module.exports = {
-    Node,
-    insertAtFront,
-    append,
-    deleteHead,
-    removeLastNode,
-    insertAtPosition,
-    deleteAtPosition,
-    reverseList,
-    countNodes,
-    rotate,
-    segregateEvenOdd,
-    display
-};
+module.exports = {};
killedBy: Linked List Operations insertAtFront - insert into empty list
statusReason: TypeError: insertAtFront is not a function
