[Killed] BlockStatement
src/queue.js:2:19
 class Queue {
-    constructor() {
-        this.items = {}
-        this.frontIndex = 0
-        this.backIndex = 0
-    }
+    constructor() {}
     enqueue(item) {
         this.items[this.backIndex] = item
killedBy: Queue Class enqueue - add items to the queue
statusReason: TypeError: Cannot set properties of undefined (setting 'undefined')

[Killed] BlockStatement
src/queue.js:7:19
         this.frontIndex = 0
         this.backIndex = 0
     }
-    enqueue(item) {
-        this.items[this.backIndex] = item
-        this.backIndex++
-        return item + ' inserted'
-    }
+    enqueue(item) {}
     dequeue() {
         const item = this.items[this.frontIndex]
killedBy: Queue Class enqueue - add items to the queue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "10 inserted"
Received: undefined

[Killed] UpdateOperator
src/queue.js:9:9
     }
     enqueue(item) {
         this.items[this.backIndex] = item
-        this.backIndex++
+        this.backIndex--
         return item + ' inserted'
     }
killedBy: Queue Class enqueue - add items to the queue
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
+   "-1": 20,
    "0": 10,

[Killed] BlockStatement
src/queue.js:12:15
         this.backIndex++
         return item + ' inserted'
     }
-    dequeue() {
-        const item = this.items[this.frontIndex]
-        delete this.items[this.frontIndex]
-        this.frontIndex++
-        return item
-    }
+    dequeue() {}
     peek() {
         return this.items[this.frontIndex]
killedBy: Queue Class dequeue - remove items from the queue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] UpdateOperator
src/queue.js:15:9
     dequeue() {
         const item = this.items[this.frontIndex]
         delete this.items[this.frontIndex]
-        this.frontIndex++
+        this.frontIndex--
         return item
     }
killedBy: Queue Class dequeue - remove items from the queue
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] BlockStatement
src/queue.js:18:12
         this.frontIndex++
         return item
     }
-    peek() {
-        return this.items[this.frontIndex]
-    }
+    peek() {}
     get printQueue() {
         return this.items;
killedBy: Queue Class peek - should return the first element without removing it
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] BlockStatement
src/queue.js:21:22
     peek() {
         return this.items[this.frontIndex]
     }
-    get printQueue() {
-        return this.items;
-    }
+    get printQueue() {}
 }
 
killedBy: Queue Class enqueue - add items to the queue
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"0": 10, "1": 20}
Received: undefined
