[Killed] BlockStatement
src/stack.js:2:23
 class Stack {
-    constructor(size) {
-        this.maxSize = size;
-        this.stackArray = [];
-        this.topIndex = -1;  // Changed `top` to `topIndex` to avoid name conflict
-    }
+    constructor(size) {}
 
     // Method to push an element onto the stack
killedBy: Stack Class Tests push - add item to stack
statusReason: TypeError: Cannot set properties of undefined (setting 'NaN')

[Survived] ArrayDeclaration
src/stack.js:4:27
 class Stack {
     constructor(size) {
         this.maxSize = size;
-        this.stackArray = [];
+        this.stackArray = ["Stryker was here"];
         this.topIndex = -1;  // Changed `top` to `topIndex` to avoid name conflict
     }

[Killed] UnaryOperator
src/stack.js:5:25
     constructor(size) {
         this.maxSize = size;
         this.stackArray = [];
-        this.topIndex = -1;  // Changed `top` to `topIndex` to avoid name conflict
+        this.topIndex = +1;  // Changed `top` to `topIndex` to avoid name conflict
     }
 
killedBy: Stack Class Tests pop - remove item from stack
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 10

[Killed] BlockStatement
src/stack.js:9:17
     }
 
     // Method to push an element onto the stack
-    push(value) {
-        if (this.topIndex === this.maxSize - 1) {
-            console.log("Stack overflow");
-            return;
-        }
-        this.stackArray[++this.topIndex] = value;
-        //console.log(value + " pushed into the stack");
-    }
+    push(value) {}
 
     // Method to pop an element from the stack
killedBy: Stack Class Tests push - add item to stack
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: -1

[Killed] EqualityOperator
src/stack.js:10:13
 
     // Method to push an element onto the stack
     push(value) {
-        if (this.topIndex === this.maxSize - 1) {
+        if (this.topIndex !== this.maxSize - 1) {
             console.log("Stack overflow");
             return;
killedBy: Stack Class Tests push - add item to stack
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: -1

[Killed] ConditionalExpression
src/stack.js:10:13
 
     // Method to push an element onto the stack
     push(value) {
-        if (this.topIndex === this.maxSize - 1) {
+        if (true) {
             console.log("Stack overflow");
             return;
killedBy: Stack Class Tests push - add item to stack
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: -1

[Killed] StringLiteral
src/stack.js:11:25
     // Method to push an element onto the stack
     push(value) {
         if (this.topIndex === this.maxSize - 1) {
-            console.log("Stack overflow");
+            console.log("");
             return;
         }
killedBy: Stack Class Tests push - stack overflow
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Stack overflow"
Received: ""

Number of calls: 1

[Killed] UpdateOperator
src/stack.js:14:25
             console.log("Stack overflow");
             return;
         }
-        this.stackArray[++this.topIndex] = value;
+        this.stackArray[--this.topIndex] = value;
         //console.log(value + " pushed into the stack");
     }
killedBy: Stack Class Tests push - stack overflow
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Stack overflow"

Number of calls: 0

[Killed] BlockStatement
src/stack.js:19:11
     }
 
     // Method to pop an element from the stack
-    pop() {
-        if (this.topIndex === -1) {
-            console.log("Stack underflow");
-            return -1;
-        }
-        const poppedElement = this.stackArray[this.topIndex--];
-       // console.log(poppedElement + " popped from the stack");
-        return poppedElement;
-    }
+    pop() {}
 
     // Method to peek the top element of the stack
killedBy: Stack Class Tests pop - remove item from stack
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] BlockStatement
src/stack.js:20:35
 
     // Method to pop an element from the stack
     pop() {
-        if (this.topIndex === -1) {
-            console.log("Stack underflow");
-            return -1;
-        }
+        if (this.topIndex === -1) {}
         const poppedElement = this.stackArray[this.topIndex--];
        // console.log(poppedElement + " popped from the stack");
killedBy: Stack Class Tests pop - stack underflow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: undefined

[Killed] EqualityOperator
src/stack.js:20:13
 
     // Method to pop an element from the stack
     pop() {
-        if (this.topIndex === -1) {
+        if (this.topIndex !== -1) {
             console.log("Stack underflow");
             return -1;
killedBy: Stack Class Tests pop - remove item from stack
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: -1

[Killed] StringLiteral
src/stack.js:21:25
     // Method to pop an element from the stack
     pop() {
         if (this.topIndex === -1) {
-            console.log("Stack underflow");
+            console.log("");
             return -1;
         }
killedBy: Stack Class Tests pop - stack underflow
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Stack underflow"
Received: ""

Number of calls: 1

[Killed] UnaryOperator
src/stack.js:22:20
     pop() {
         if (this.topIndex === -1) {
             console.log("Stack underflow");
-            return -1;
+            return +1;
         }
         const poppedElement = this.stackArray[this.topIndex--];
killedBy: Stack Class Tests pop - stack underflow
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 1

[Killed] UpdateOperator
src/stack.js:24:47
             console.log("Stack underflow");
             return -1;
         }
-        const poppedElement = this.stackArray[this.topIndex--];
+        const poppedElement = this.stackArray[this.topIndex++];
        // console.log(poppedElement + " popped from the stack");
         return poppedElement;
killedBy: Stack Class Tests pop - remove item from stack
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] BlockStatement
src/stack.js:30:12
     }
 
     // Method to peek the top element of the stack
-    peek() {  // Renamed from `top` to `peek`
-        if (this.topIndex === -1) {
-            console.log("Stack is empty");
-            return -1;
-        }
-        return this.stackArray[this.topIndex];
-    }
+    peek() {}
 
     // Method to check if the stack is empty
killedBy: Stack Class Tests push - add item to stack
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] EqualityOperator
src/stack.js:31:13
 
     // Method to peek the top element of the stack
     peek() {  // Renamed from `top` to `peek`
-        if (this.topIndex === -1) {
+        if (this.topIndex !== -1) {
             console.log("Stack is empty");
             return -1;
killedBy: Stack Class Tests push - add item to stack
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: -1

[Killed] UnaryOperator
src/stack.js:31:31
 
     // Method to peek the top element of the stack
     peek() {  // Renamed from `top` to `peek`
-        if (this.topIndex === -1) {
+        if (this.topIndex === +1) {
             console.log("Stack is empty");
             return -1;
killedBy: Stack Class Tests peek - peek top element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: -1

[Killed] UnaryOperator
src/stack.js:33:20
     peek() {  // Renamed from `top` to `peek`
         if (this.topIndex === -1) {
             console.log("Stack is empty");
-            return -1;
+            return +1;
         }
         return this.stackArray[this.topIndex];
killedBy: Stack Class Tests peek - empty stack
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 1

[Killed] BlockStatement
src/stack.js:39:15
     }
 
     // Method to check if the stack is empty
-    isEmpty() {
-        return this.topIndex === -1;
-    }
+    isEmpty() {}
 }
 
killedBy: Stack Class Tests isEmpty - check if stack is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/stack.js:40:16
 
     // Method to check if the stack is empty
     isEmpty() {
-        return this.topIndex === -1;
+        return true;
     }
 }
killedBy: Stack Class Tests isEmpty - check if stack is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] UnaryOperator
src/stack.js:40:34
 
     // Method to check if the stack is empty
     isEmpty() {
-        return this.topIndex === -1;
+        return this.topIndex === +1;
     }
 }
killedBy: Stack Class Tests isEmpty - check if stack is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
